{
  "batch_id": "batch_20260223_052751",
  "created_at": "2026-02-23T05:27:51.759047",
  "story_count": 32,
  "stories": [
    {
      "id": "story_001_a_passing_angel_rescues_woman_8months_pregnant_from_her_sink",
      "title": "A Passing ‘Angel’ Rescues Woman 8-Months Pregnant from Her Sinking Car",
      "summary": "On her 29th birthday, eight-months-pregnant Shedly Appolon lost control of her car on I-95 and plunged into a pond. As water filled the cabin and doors wouldn't budge, Logan Hayes dove in and opened the back door just before it submerged. Appolon called him her angel—and for good reason.",
      "extended_summary": "Shedly Appolon was eight months pregnant and celebrating her 29th birthday when sudden dizziness sent her car tumbling off I-95 into a Martin County pond. Water seeped through the floor as the vehicle tilted forward, doors sealed shut by the pressure. Her panicked call to her fiancé cut off just as she realized she was trapped. That's when Logan Hayes stripped off his jacket, sprinted to the water's edge, and swam to the sinking car. He yanked open the back door seconds before it disappeared beneath the murky surface, pulling Appolon to safety. She calls him her angel—a stranger who showed up at exactly the right moment.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Surprise",
        "Human Story"
      ],
      "source_url": "https://www.goodnewsnetwork.org/a-passing-angel-rescues-woman-8-months-pregnant-from-her-sinking-car/",
      "source_name": "goodnewsnetwork.org",
      "published_ts": 1771852892682,
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/Pregnant-woman-saved-from-Florida-crash-Courtesy-of-Shedly-Appolon-and-the-Martin-County-Fire-Rescue.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_002_as_he_battles_cancer_richard_dibella_drives_others_to_treatm",
      "title": "As He Battles Cancer, Richard DiBella Drives Others to Treatment",
      "summary": "Mt. Lebanon lawyer Richard DiBella once donated a kidney to a sick child. Now, while battling his own cancer, he drives cancer patients to treatment through the American Cancer Society's Road to Recovery program. Some passengers talk, some stay silent—DiBella accommodates whatever they need. \"As long as I can drive, I'll keep doing it,\" he says.",
      "extended_summary": "Richard DiBella donated a kidney years ago to a sick child—he jokes that while he's never been to Hawaii, his kidney has. Now the Mt. Lebanon lawyer is fighting his own cancer, but that hasn't stopped him from volunteering as a driver for the American Cancer Society's Road to Recovery program. At least once a week, he chauffeurs patients to their medical appointments, offering companionship during those long, emotionally charged drives. Some passengers use the time like a therapy session. Others prefer silence. DiBella is fine with either. Transportation barriers are the number one reason people miss life-saving treatments, and he's determined to remove that obstacle for as many people as he can. \"As long as I can drive,\" he says, \"I'll keep doing it.\"",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story",
        "Transformation"
      ],
      "source_url": "https://www.pittsburghmagazine.com/acs-road-to-recovery-program/",
      "source_name": "pittsburghmagazine.com",
      "published_ts": 1771852892682,
      "image_url": "https://www.pittsburghmagazine.com/content/uploads/2026/02/j/q/roadtorecovery2.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_003_albertus_magnus_students_send_letters_with_love",
      "title": "Albertus Magnus Students Send “Letters With Love”",
      "summary": "What started as senior JohnCarlo Mandara making Valentine's cards for isolated elderly residents has grown into Letters with Love, a certified nonprofit with 100+ participants. The organization has delivered over 1,500 handwritten cards to addiction recovery patients, nurses, hospitalized children, farmers, teachers, and bus drivers—each one hand-delivered with care.",
      "extended_summary": "JohnCarlo Mandara wanted to combat loneliness during Valentine's Day, so he started making cards for senior citizens in care facilities who rarely get visitors. One year later, that simple act of kindness has become Letters with Love, a certified nonprofit with more than 100 participants and over 1,500 handwritten cards delivered. Each month focuses on a different group: people in addiction recovery, nurses, hospitalized children, farmers, teachers, and even bus drivers. Fellow Albertus Magnus senior Antonella Caraballo Pelaez joined after seeing how overwhelmed Mandara was managing it all, and now serves as his second-in-command. Every card is handmade, and every card is personally delivered—because knowing someone took the time to write changes everything.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://rocklandtimes.com/2026/02/12/albertus-magnus-students-send-letters-with-love/",
      "source_name": "rocklandtimes.com",
      "published_ts": 1771852892682,
      "image_url": "https://rocklandtimes.com/wp-content/uploads/2026/02/10EB2E00-6C46-48B8-B3CA-FDCF5CB4C913-525x700.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_004_township_commends_elizabeth_ross_who_overcame_a_physical_dis",
      "title": "Township Commends Elizabeth Ross, Who Overcame a Physical Disability to Pull a Third Grader Out of a Lake Where He Had Fallen Through the Ice, and Her 11-Year-Old, Skylar, Who Recognized the Deep Trouble He Was in",
      "summary": "Elizabeth Ross has lived with rheumatoid arthritis for 20 years and had just finished her monthly infusion therapy when her daughter Skylar alerted her to a child who'd fallen through the ice. Without hesitation, Elizabeth overcame her disability to pull the third grader from the freezing lake. Medford Township honored the mother-daughter duo as real-life superheroes.",
      "extended_summary": "On January 20, Elizabeth Ross was having what she calls \"my worst day of the month\"—she'd just finished infusion therapy for the rheumatoid arthritis that's plagued her for two decades. That's when her 11-year-old daughter Skylar spotted one of her schoolmates, a third grader, who had fallen through the ice on their neighborhood lake. Without a second thought about her physical limitations, Elizabeth sprang into action with almost superhuman strength and agility, pulling the child from the frigid water and saving his life. Medford Township Mayor Michael Czyzyk presented the mother-daughter team with a proclamation of \"gratitude and admiration,\" calling them real-life superheroes. Elizabeth's message: when someone needs help, your body finds a way.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://www.pinebarrenstribune.com/articles/featured-stories/township-commends-elizabeth-ross-who-overcame-a-physical-disability-to-pull-a-third-grader-out-of-a-lake-where-he-had-fallen-through-the-ice-and-her-11-year-old-skylar-who-recognized-the-deep-trou/",
      "source_name": "pinebarrenstribune.com",
      "published_ts": 1771852892682,
      "image_url": "https://www.pinebarrenstribune.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-191156-1200x628.png",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_005_a_coin_flip_that_led_to_helping_change_lives_uh_project_help",
      "title": "A coin flip that led to helping change lives- UH project help young children with mobility disabilities",
      "summary": "Ph.D. student Jesus Rodriguez joined the University of Houston specifically to work on P-LEGS, a robotic exoskeleton that helps young children with mobility disabilities learn to walk. His career path came down to a coin flip between computer science and engineering—but his commitment to helping people was never in question.",
      "extended_summary": "Jesus Rodriguez had studied neuroscience but realized lab work wasn't his calling. Torn between computer science and engineering, he literally flipped a coin. Engineering won—and then he discovered the P-LEGS project at the University of Houston. P-LEGS is a robotic exoskeleton designed to rehabilitate young children with mobility disabilities, giving them the chance to walk when their bodies can't do it alone. Rodriguez applied to UH specifically to work with principal investigator Jose Luis Contreras-Vidal on this project. \"Helping people is something I want to do the rest of my life,\" Rodriguez said. That coin flip might have been random, but his purpose wasn't.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://thedailycougar.com/2026/02/18/a-coin-flip-that-led-to-helping-change-lives-uh-project-help-young-children-with-mobility-disabilities/?utm_source=rss&utm_medium=rss&utm_campaign=a-coin-flip-that-led-to-helping-change-lives-uh-project-help-young-children-with-mobility-disabilities",
      "source_name": "thedailycougar.com",
      "published_ts": 1771852892682,
      "image_url": "https://thedailycougar.com/wp-content/uploads/2026/02/021126_Jesus-Rodriguez_RFernandez-2.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_006_burke_center_gets_new_pole_shelter_through_scout_project",
      "title": "Burke Center gets new pole shelter through scout project",
      "summary": "Hudson Debish is building a $6,000 pole shelter for the Burke Center for Youth's livestock trailers as his Eagle Scout project. About 30 scouts will volunteer over six weekends to complete the structure, which will protect equipment from Texas weather and demonstrate to foster youth that their community cares.",
      "extended_summary": "Thirty Boy Scouts are spending their Saturdays building something bigger than a shelter. Hudson Debish chose the Burke Center for Youth — a home for boys in foster care — for his Eagle Scout project, following in his brother's footsteps. The $6,000 pole structure will shield livestock trailers from brutal Texas sun, but Hudson sees a deeper purpose: showing kids who've survived hard things that strangers care enough to spend months building something just for them. \"They come from something hard, but we want to show we care and there is good in the world,\" he said.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://www.drippingspringsnews.com/article/3357,burke-center-gets-new-pole-shelter-through-scout-project",
      "source_name": "drippingspringsnews.com",
      "published_ts": 1771852892682,
      "image_url": "https://static2.drippingspringsnews.com/data/articles/xga-4x3-burke-center-gets-new-pole-shelter-through-scout-project-1771431970.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_007_refrog_initiative_turns_tcu_moveout_waste_into_community_don",
      "title": "ReFrog Initiative Turns TCU Move-Out Waste into Community Donations",
      "summary": "TCU's ReFrog Initiative collected over 16,500 items during move-out week, keeping the equivalent of 74 dumpsters of student belongings out of landfills. Volunteers redirected furniture, clothes, and supplies to community members who needed them instead of letting them become waste.",
      "extended_summary": "When 16,500 perfectly good items hit the curb during TCU move-out week, volunteers didn't let them become trash. The ReFrog Initiative swept through dorms collecting everything students left behind — mini-fridges, barely-used textbooks, lamps, clothing — and redirected it all to people who actually needed it. The haul filled what would have been 74 dumpsters, turning end-of-semester chaos into a massive community resource exchange. It's proof that one university's discards are another family's furnishings, and that a little coordination can keep mountains of usable stuff out of landfills.",
      "category": "Community",
      "categories": [
        "Community",
        "Discovery",
        "Other"
      ],
      "source_url": "https://magazine.tcu.edu/spring-2026/refrog-initiative-move-out-donations-waste-diversion/",
      "source_name": "magazine.tcu.edu",
      "published_ts": 1771852892682,
      "image_url": "https://magazine.tcu.edu/wp-content/uploads/2026/02/WebHeader-Spr26-Infographic-2-1-e1771420152830.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_008_the_accidental_brilliance_of_bizarre_bazaar",
      "title": "The accidental brilliance of Bizarre Bazaar",
      "summary": "What started as a radical email proposal from Joyce Spiller became the Community Assistance League's Bizarre Bazaar, a year-round resale store. After membership voted to proceed in early 2006 despite leadership concerns, the store opened three months later in Ponderay. Built on $29,000 in reserves from annual fundraisers, it now returns roughly $250,000 annually to the community.",
      "extended_summary": "Joyce Spiller sent an email proposing a year-round resale store to handle leftover donations from the Community Assistance League's 2005 rummage sale. Then she left town. A small group studied the idea, ran numbers, found locations—and the board presented it to membership expecting nothing to happen. Instead, Janet Rogers shouted out a motion, members voted yes with only one dissent, and three months later Bizarre Bazaar opened in Ponderay. It wasn't reckless: CAL had built $29,000 in reserves through reliable fundraisers like their annual rummage sale. That foundation turned into a self-sustaining enterprise now returning roughly $250,000 per year to the community. Sometimes the best ideas start with an email and a leap of faith.",
      "category": "Community",
      "categories": [
        "Community",
        "Transformation",
        "Generosity"
      ],
      "source_url": "https://sandpointreader.com/the-accidental-brilliance-of-bizarre-bazaar/",
      "source_name": "sandpointreader.com",
      "published_ts": 1771852892682,
      "image_url": "https://sandpointreader.com/wp-content/uploads/2024/10/KathrynLarson-WEB.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_009_poly_prep_students_staff_pack_and_deliver_food_to_community",
      "title": "Poly Prep students, staff pack and deliver food to community members in need",
      "summary": "Poly Prep Country Day School students and staff packed and delivered over 600 bags of food and produce to One Love Community Fridge locations across Brooklyn. More than 70 volunteers participated in the session, part of a three-times-yearly partnership addressing food insecurity. Student leaders Harper Giskan and Ellie Warwick organized the effort as part of their service-learning curriculum focused on Brooklyn's food deserts.",
      "extended_summary": "Harper Giskan is 17 and can watch her work disappear in minutes—in the best way possible. She and classmate Ellie Warwick led over 70 Poly Prep Country Day School volunteers in packing and delivering 600+ bags of produce and pantry items to One Love Community Fridge locations throughout Brooklyn. The school partners with the nonprofit three times per year to address food insecurity and malnutrition. \"It feels pretty surreal that at 17, I can make a real impact in Brooklyn,\" Giskan said, noting that fridges are emptied and enjoyed almost immediately after stocking. Warwick previously launched her own initiative, Nourishing New York, bringing people to the Bowery Mission. Now both students are integrating this work into their service-learning curriculum focused on food deserts.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://brooklynreporter.com/2026/02/poly-prep-students-staff-pack-and-deliver-food-to-community-members-in-need/",
      "source_name": "brooklynreporter.com",
      "published_ts": 1771852892682,
      "image_url": "https://brooklynreporter.com/wp-content/uploads/2026/02/Group-Photo-1024x771.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_010_restaurant_news_brief_cottage_bakery_launches_pretzels_for_p",
      "title": "Restaurant News brief: Cottage Bakery launches Pretzels for Purpose",
      "summary": "The Cottage Bakery in Edmonds launched \"Pretzels for Purpose\" to support 3½-year-old Feyre Clark, who has Hallermann-Streiff syndrome, one of fewer than 300 diagnosed cases worldwide. After spending her first 163 days in Seattle Children's Hospital, Feyre now requires 24/7 medical support but radiates joy through music, dancing, and adventure. The fundraiser offers pretzel knots, drinks, and local business deals with all proceeds supporting the Clark family.",
      "extended_summary": "Feyre Clark came into the world fighting for air. Born with Hallermann-Streiff syndrome—fewer than 300 cases worldwide—she spent her first 163 days at Seattle Children's Hospital undergoing a tracheotomy, G-tube placement, and lifesaving interventions. Now 3½, she requires round-the-clock medical support at home but has become a force of relentless happiness: music, dancing, painting, parties, any adventure she can join. Her favorite place to explore is Edmonds, where The Cottage Bakery just launched \"Pretzels for Purpose\" in her honor. Tickets include pretzel knots, drinks, dipping sauce, and deals from local businesses, with all proceeds going to her family to prioritize her quality of life and ability to truly live.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://mymltnews.com/restaurant-news-brief-cottage-bakery-launches-pretzels-for-purpose/",
      "source_name": "mltnews.com",
      "published_ts": 1771852892682,
      "image_url": "https://dpa730eaqha29.cloudfront.net/mltnews/wp-content/uploads/2026/02/Feyre-and-her-parents-Jessica-and-Justin-Clark.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_011_alexander_amp_mandaree_boys_basketball_teams_join_in_showing",
      "title": "Alexander &amp; Mandaree Boys Basketball Teams Join In Showing What Great Sportsmanship Means",
      "summary": "During Alexander High School's final home basketball game, two moments defined true sportsmanship. Senior Porter Soiseth, sidelined by injury most of the season, shot his last basket with the opposing Mandaree Warriors' respectful support. Later, freshman Mason Lucas, who has autism and faced bullying growing up, entered the game in the final minutes, bringing joy to the packed gymnasium.",
      "extended_summary": "The gym was packed for Alexander High's last home game—senior night, Comets winning 66-41. But the score wasn't what people would remember. First, injured senior Porter Soiseth stepped onto his home court one last time, leg brace on, to shoot his final basket. The Mandaree Warriors didn't interfere; they let him have his moment. Then, in the closing minutes, Coach Aaron Allard put in freshman Mason Lucas. Mason has autism and loves basketball more than anything, despite being bullied for years. His mom says \"Basketball is definitely his favorite.\" When he hit the court, his smile lit up the entire gymnasium. Two kids, different stories, same respect—that's what Alexander remembers from senior night.",
      "category": "Sports",
      "categories": [
        "Sports",
        "Community",
        "Human Story"
      ],
      "source_url": "HTTPS://www.roundupweb.com/story/2026/02/18/sports/alexander-andamp-mandaree-boys-basketball-teams-join-in-showing-what-great-sportsmanship-means/23776.html",
      "source_name": "roundupweb.com",
      "published_ts": 1771852892682,
      "image_url": "https://www.roundupweb.com/home/cms_data/dfault/photos/stories/id/7/6/23776/s_top",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 2
    },
    {
      "id": "story_012_service_with_a_smile_the_heart_behind_mu_dining",
      "title": "Service with a smile: The heart behind MU Dining",
      "summary": "Terrance Ewing and Carmen Plant transform Marshall University dining halls into spaces of genuine connection. Ewing, who describes himself as an \"energy person,\" engages students through thought-provoking questions and listening, creating moments where stressed students find unexpected comfort. He believes food paired with conversation has healing power—\"I never met someone mad if I offered them a meal.\"",
      "extended_summary": "Terrance Ewing can feel when students walk into the Marshall University dining hall carrying the weight of exams, relationships, or life. As a food service worker, he feeds off that energy and meets it with curiosity—sometimes asking simple but deep questions like the difference between truth and honesty, other times just listening. \"Food mixed with a little conversation and inquisitiveness goes a long way,\" he says. Students have broken down in tears, telling him they needed to hear exactly what he said. Ewing's favorite reminder: \"I never met someone mad if I offered them a meal.\" Alongside him, Carmen Plant also turns the counters into spaces of comfort. They're not just serving food; they're serving presence.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Community",
        "Generosity"
      ],
      "source_url": "https://marshallparthenon.com/41169/campus-life/service-with-a-smile-the-heart-behind-mu-dining/",
      "source_name": "marshallparthenon.com",
      "published_ts": 1771852892682,
      "image_url": "https://marshallparthenon.com/wp-content/uploads/2026/02/Terrane-Ewing-e1770752718880.jpeg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_013_jaden_smiths_real_dream_is_to_help_people_on_skid_row_throug",
      "title": "Jaden Smith’s ‘real dream’  is to help people on Skid Row through his brand ‘I LOVE YOU’",
      "summary": "Jaden Smith's long-term dream is opening a brick-and-mortar space on Skid Row offering free daily meals, job creation, and community. He launched \"I Love You Restaurant\" food truck in 2019 serving free vegan food to the homeless. Now he's releasing limited-edition merch through his \"I LOVE YOU\" brand, with all profits supporting the expansion toward a permanent location.",
      "extended_summary": "Forget the fashion interviews—Jaden Smith's real dream is a building on Skid Row where he can serve free breakfast, lunch, and dinner every single day. Since 2019, he's been running \"I Love You Restaurant,\" a food truck offering healthy vegan meals to people experiencing homelessness. Now he's expanding the \"I LOVE YOU\" brand with limited-edition graphic tees, and all profits go toward making that brick-and-mortar dream real. \"We're for the people, and funded by the people,\" he told Hypebeast. Smith says he wants to create jobs, build good vibes, and invite his followers on the journey with him—not through corporate sponsorships, but through a community that actually cares.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://thegrio.com/2026/02/18/jaden-smiths-real-dream-is-to-help-people-on-skid-row-through-his-brand-i-love-you/",
      "source_name": "thegrio.com",
      "published_ts": 1771852892682,
      "image_url": "https://thegrio.com/wp-content/uploads/2026/02/GettyImages-2255351332-scaled-e1771430028845.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_014_mend_and_munch",
      "title": "Mend and Munch",
      "summary": "The Scotts Run Resonance Project hosts quarterly Repair Cafés where volunteers fix belongings for free while guests enjoy food and live music. Events draw 50-100 people of all ages to learn repair skills, socialize, and restore items from lamps to cast iron pots. One woman discovered her creekbed find was worth $1,500 after bringing it in for restoration.",
      "extended_summary": "A woman walked into a Repair Café carrying a cast iron pot she'd pulled from a creekbed by her childhood home. An internet search revealed it was worth $1,500. That's the kind of discovery that happens when a community gathers to fix things instead of tossing them. The Scotts Run Resonance Project runs these quarterly events where 10-15 skilled volunteers restore whatever people bring—sewing, lamp repair, oddball projects—all free of charge. Between 50 and 100 people show up to learn, eat together, and listen to live music. Director D.J. Cassell, a self-described \"cast iron nerd,\" encourages people to bring anything and see who can fix it. The events have become as much about connection as repair.",
      "category": "Community",
      "categories": [
        "Community",
        "Discovery",
        "Human Story"
      ],
      "source_url": "https://morgantownmag.com/mend-and-munch/?utm_source=rss&utm_medium=rss&utm_campaign=mend-and-munch",
      "source_name": "morgantownmag.com",
      "published_ts": 1771852892683,
      "image_url": "https://morgantownmag.com/wp-content/uploads/Courtesy-of-D.J.-Cassell-2.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_015_riversides_grams_bbq_a_hub_for_community_and_second_chances",
      "title": "Riverside’s Gram’s BBQ: A Hub for Community and Second Chances",
      "summary": "Gram's BBQ in Riverside, California, was founded by a man determined to transform his life after prison. Robert Palmer Bratton opened the restaurant as a space for second chances and community connection. Today, his daughter Benita operates it, watching employees grow from young workers into parents while the restaurant remains a gathering place for locals and returning visitors.",
      "extended_summary": "Robert Palmer Bratton knew he'd lived \"a very, very fast life\" and made choices he regretted, including time in prison. When he got out, he opened Gram's BBQ in Riverside not just as a restaurant, but as proof of transformation and a space for second chances. For over three decades, it's been exactly that. His daughter Benita now runs it and sees the full arc: employees who started young now have families of their own, former residents return to reconnect over soul food, and the menu has evolved to include health-conscious options without losing its roots. It's a place where people look back on their lives and see how far they've come.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://theievoice.com/second-chances-grams-bbq/",
      "source_name": "theievoice.com",
      "published_ts": 1771852892683,
      "image_url": "https://theievoice.com/wp-content/uploads/2026/02/1280x721_voice_Gram_barbque.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_016_standing_ovation_for_smithtown_father_and_son",
      "title": "Standing Ovation For Smithtown Father And Son",
      "summary": "A Smithtown father-son duo received a standing ovation after rescuing two people who fell through ice during a winter storm. Bradley Fils-Aime heard cries for help, spotted victims in freezing water at Gibbs Pond, and called his FDNY lieutenant father, who helped coordinate the rescue with emergency responders. Both victims were treated for hypothermia and survived.",
      "extended_summary": "Bradley Fils-Aime was home during a January storm when he heard screaming outside. He jumped his fence and saw a father and 12-year-old son struggling in icy water at Gibbs Pond—the boy had fallen in trying to save his dad. Bradley immediately got his father John, an FDNY lieutenant, who rushed to the scene while Bradley's mother called 911. Working with park rangers and firefighters, they coached the victims to crawl across the ice until rescuers could pull them out. Both were hospitalized for hypothermia but survived. The Smithtown school board honored the pair with official commendations and a standing ovation.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community",
        "Human Story"
      ],
      "source_url": "https://longislandmediagroup.com/standing-ovation-for-smithtown-father-and-son/",
      "source_name": "theneighbornewspapers.com",
      "published_ts": 1771852892683,
      "image_url": "https://longislandmediagroup.com/wp-content/uploads/2026/02/Smithtown-BOE-honors-fatherson.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_017_shes_building_a_support_network_for_nashvilles_live_music_co",
      "title": "She’s Building a Support Network for Nashville’s Live Music Community",
      "summary": "Kara Kemp manages ECCHO Live, a Nashville organization providing mental health support and practical resources to the live music industry's behind-the-scenes workers. After years touring with catering crews, she now helps fill gaps for gig workers through free counseling at festivals, retirement planning guidance, and healthcare navigation. The work supports an industry built on temporary employment where essential workers often go unseen.",
      "extended_summary": "Most people see concerts. Kara Kemp sees the hundreds of crew members who make them possible—and the toll that unstable gig work takes. As General Manager of ECCHO Live, she's built a support system for Nashville's live music workers: free therapy sessions at major festivals, retirement savings guidance, healthcare navigation, all filling gaps in an industry with no safety net. She got there through her own years on the road with touring catering crews, work that felt natural growing up as the youngest of nine on a farm. Now she's creating the infrastructure that didn't exist when she started—turning invisible essential work into something the industry actually cares for.",
      "category": "Community",
      "categories": [
        "Community",
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://styleblueprint.com/everyday/kara-kemp-eccho-live/",
      "source_name": "styleblueprint.com",
      "published_ts": 1771852892683,
      "image_url": "https://styleblueprint.com/wp-content/uploads/2026/02/SBNash-FACE-KaraKemp-Enis-Demirci-feature.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_018_green_river_city_councilman_recognized_as_a_2026_hero_by_uta",
      "title": "Green River City Councilman recognized as a 2026 Hero by Utah Chapter of Founding Forward",
      "summary": "When a man was stranded in a flash flood wash in Green River, Deputy Josh Opp and City Councilman Kent Nelson tied a raft to a front-end loader to pull him out. Nelson was recognized as a 2026 Hero by Utah's Founding Forward—but the city says the award reflects the whole community's instinct to move toward danger, not away from it.",
      "extended_summary": "A man was trapped in Saleratus Wash during a flash flood on Airport Road in Green River. Deputy Josh Opp and Councilman Kent Nelson didn't hesitate—they tied a raft to a front-end loader and pulled him to safety. Nelson was recognized as a 2026 Hero by the Utah Chapter of Founding Forward for civic responsibility and leadership, but he'd be the first to say the honor belongs to everyone involved. Neighbors helped neighbors. First responders did what they do best. Ordinary people moved toward danger instead of away from it. The city says the moment reflects who Green River is when things get hard: a community that shows up.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://etvnews.com/articles/local-news/green-river-city-councilman-recognized-as-a-2026-hero-by-utah-chapter-of-founding-forward/",
      "source_name": "etvnews.com",
      "published_ts": 1771852892683,
      "image_url": "https://etvnews.com/wp-content/uploads/2026/02/Kent--1200x628.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_019_work_recovery_and_second_chances_on_a_wisconsin_manufacturin",
      "title": "Work, recovery and second chances on a Wisconsin manufacturing floor",
      "summary": "Mellisa Edwards hadn't worked in a decade while battling addiction. Last March, she got a job at Apricity Contract Packaging—a Wisconsin manufacturer run entirely by people in recovery. After a rough start, her coworkers helped her turn things around. Now she shows up on time, earns perfect reviews, and is building a stable future.",
      "extended_summary": "Mellisa Edwards didn't want to get out of bed. She'd missed shifts, gotten written up, and was struggling at her new job at Apricity Contract Packaging in Appleton. But her coworkers understood—they were all in recovery too. Apricity is run entirely by people rebuilding their lives after addiction, employing roughly 100 people a year across Wisconsin in a judgment-free environment. Edwards, who hadn't worked in a decade, turned things around with their support. Now she's always on time, earned a perfect performance review, and plans to stay another year while finishing residential treatment. She's not just packaging products—she's building sobriety and a stable employment record, one shift at a time.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://wisconsinwatch.org/2026/02/wisconsin-work-recovery-apricity-contract-packaging-manufacturing-appleton/",
      "source_name": "wisconsinwatch.org",
      "published_ts": 1771852892683,
      "image_url": "https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse313__Apricity_Appleton_Jan_26-scaled.jpg?fit=1200%2C801&quality=100&ssl=1",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_020_1st_grade_teacher_asked_students_to_color_their_favorite_hat",
      "title": "1st grade teacher asked students to color their 'favorite' hat. She then secretly created each one for real.",
      "summary": "First grade teacher Ashley Lowry had her 22 students color in drawings of winter hats—then secretly spent winter break sewing each design into a real hat. When she surprised them with the finished products, their reactions were pure magic. Some kids designed solid colors, others went for stripes, all got their dreams made real.",
      "extended_summary": "Ashley Lowry's first graders at Wallace Elementary in Kelso, Washington, were given photocopies of blank winter hats and told to color in their favorite designs. Some chose solid blues or purples. Others went wild with repeating patterns and stripes. The kids thought it was just a fun coloring activity. Then winter break came. Lowry took those 22 drawings home and spent her break sewing each one into a real hat—every stripe, every pattern, every color exactly as the kids had imagined. When she surprised them after break, their reactions were pure joy. \"You cannot put a price on a good teacher,\" one observer noted. Lowry didn't just teach a lesson—she showed her students that their ideas matter, and dreams can become real.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Community",
        "Generosity"
      ],
      "source_url": "https://www.upworthy.com/teacher-surprises-students-with-hats",
      "source_name": "upworthy.com",
      "published_ts": 1771852892683,
      "image_url": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82NDQyNjg4OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4OTQzNzYyNH0.F4o1Rm0WXCzNkIB5AzRgsCJXOoyFZjg_qNgo_ocvon0/img.jpg?width=1200&height=600&coordinates=0%2C8%2C0%2C172",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_021_these_students_tricked_teachers_with_phishing_emailsfor_a_go",
      "title": "These Students Tricked Teachers With Phishing Emails—for a Good Cause",
      "summary": "Students in a Kentucky cybersecurity class sent a convincing phishing email to 164 school employees—complete with urgent subject line and official-sounding language. The 29 staff who clicked were redirected to a page revealing they'd been tricked by their own students, teaching a critical lesson about digital security in a hands-on way.",
      "extended_summary": "The email looked urgent and official: \"Teacher and Staff Guideline Update—Please complete today.\" It appeared to come from an instructional coach and asked Eminence Independent School staff to click a link acknowledging new guidelines. Twenty-nine of 164 employees clicked. But this wasn't a real phishing attack—it was a lesson. Students in Jennifer Gilbert's cybersecurity class had crafted the email to teach staff how easy it is to fall for these traps, which real cybercriminals use to worm into K-12 servers. When staff clicked, they were redirected to a page signed by the students, revealing the trick. In an era when generative AI makes phishing emails easier to craft convincingly, these Kentucky students just gave their teachers an unforgettable crash course.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Community",
        "Humor"
      ],
      "source_url": "https://www.edweek.org/technology/these-students-tricked-teachers-with-phishing-emails-for-a-good-cause/2026/02",
      "source_name": "edweek.org",
      "published_ts": 1771852892683,
      "image_url": "https://epe.brightspotcdn.com/dims4/default/a9cf0a1/2147483647/strip/true/crop/7167x4792+0+0/resize/942x630!/quality/90/?url=https%3A%2F%2Fepe-brightspot.s3.us-east-1.amazonaws.com%2Fa4%2Faf%2Fc89ff60a444ea296c25c2738392f%2F021126-ed-tec-sr-phishing-klein-fs-2217309892.jpg",
      "display_mode": "text",
      "display_reason": "medium image not worth the space",
      "image_confidence": "medium",
      "visual_affinity": 2,
      "headline_pull": 5
    },
    {
      "id": "story_022_how_one_states_hunters_are_taking_aim_at_rural_hunger",
      "title": "How one state's hunters are taking aim at rural hunger",
      "summary": "Georgia hunters are allowed to kill up to 12 deer a year—far more than most families can eat. Through the Hunters for the Hungry program, they're donating the extra to soup kitchens. This year's goal: 140,000 pounds of venison, enough to feed 560,000 people. One Savannah processor has already sent 500 pounds to a local mission.",
      "extended_summary": "Outside Wise Brothers Processing in Savannah, coolers full of skinned deer wait on ice. Most will be wrapped and sent home to hunters' freezers—but 500 pounds of ground venison so far this year is heading to Old Savannah City Mission, which feeds 250-plus people three times a day. The Wises are part of Georgia's Hunters for the Hungry program, which helps hunters donate deer they can't store or don't need. The state recently boosted funding to $350,000, expanding from six processors to 56 and adding freezer trailers. This year's goal: 140,000 pounds of donations, feeding an estimated 560,000 people with meat that would otherwise go to waste.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://kvia.com/stacker-social-issues/2026/02/18/how-one-states-hunters-are-taking-aim-at-rural-hunger/",
      "source_name": "kvia.com",
      "published_ts": 1771852892683,
      "image_url": "https://live-kvia.pantheonsite.io/wp-content/uploads/2026/02/georgia-hunters.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_023_she_slangs_wood_on_a_mission_to_empower_educate_milwaukee",
      "title": "She Slangs Wood on a mission to empower, educate  Milwaukee",
      "summary": "Tonda Thompson started a pandemic woodworking hobby with her toddler and turned it into She Slangs Wood, a Milwaukee carpentry business with a mission: create jobs, teach skills, and tackle homelessness, violence, and health disparities in her community. Her crew is building fences—and pathways out of poverty.",
      "extended_summary": "Tonda Thompson and her 3-year-old were stuck inside during the pandemic, watching 'Mickey Mouse Clubhouse' on repeat. Her son thought he was Mickey; she started building things. That hobby became She Slangs Wood, a Milwaukee carpentry and furniture business with a bigger goal than residential fences. Thompson's mission is to reduce social determinants of health—joblessness, homelessness, violence, racial discrimination—by creating lucrative jobs and teaching woodworking skills to people who need pathways forward. Her crew, many with construction experience, is learning carpentry while building something more: economic opportunity and community stability, one project at a time.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://www.wpr.org/culture/she-slangs-wood-mission-empower-educate-milwaukee-tonda-thompson",
      "source_name": "wpr.org",
      "published_ts": 1771852892683,
      "image_url": "https://www.wpr.org/wp-content/uploads/2026/02/thumbnail_IMG_8971-e1771342862863.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_024_months_after_receiving_lifesaving_kidney_donation_bayside_ma",
      "title": "Months after receiving life-saving kidney donation, Bayside man is working to help others find donors and spread awareness",
      "summary": "Marc Perez's kidneys were failing—he had weeks until dialysis and years on a transplant waiting list. Then he turned to social media, sharing his story publicly. Last October, he received a life-saving kidney from a donor who saw his posts. Now he's helping others do the same, spreading awareness to shorten the brutal wait.",
      "extended_summary": "By October 2023, Marc Perez's kidney function had dropped below 15%. The 41-year-old Bayside resident was facing dialysis three days a week, 15 hours total, while waiting two to four years for a transplant. Diagnosed with advanced IgA Nephropathy in 2009, Perez knew his kidneys were on borrowed time. So he turned to social media, publicly sharing his need for a donor. It worked. Last October, he got his transplant—a stranger's generosity gave him a second chance. Now Perez is on a mission to help others in his position get their messages out, knowing that visibility can mean the difference between years of waiting and life.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Generosity",
        "Community"
      ],
      "source_url": "https://qns.com/2026/02/life-saving-kidney-donation-bayside-man-help-other/",
      "source_name": "qns.com",
      "published_ts": 1771852892683,
      "image_url": "https://qns.com/wp-content/uploads/2026/02/IMG_0871-e1771360463655.jpg?quality=51&w=1200&p=q",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_025_lorain_high_school_teacher_gives_the_ultimate_valentines_day",
      "title": "Lorain High School teacher gives the ultimate Valentine’s Day gift to a complete stranger",
      "summary": "Lorain High School teacher Marissa Garcia joined the bone marrow registry in 2015 after learning how few Hispanic donors existed. Nearly a decade later, she got the call: she was a match for a leukemia patient in Italy. Her donation gave a complete stranger—and her own family shaped by cancer—a shot at life.",
      "extended_summary": "The phone rang just after New Year's. Nearly ten years after Marissa Garcia signed up for the bone marrow registry at a church event, she was told she was a match—for a leukemia patient in Italy. Garcia, a Lorain High School teacher who'd lost her grandfather to leukemia and her grandmother to pancreatic cancer, had joined because Hispanic donors are critically underrepresented, making it harder for patients to find matches. What followed was a rapid, medically demanding process. But for Garcia, it was personal: a chance to honor her family's losses and give a stranger across the ocean a second chance at life.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story",
        "Transformation"
      ],
      "source_url": "https://www.cleveland.com/lorain-county/2026/02/lorain-high-school-teacher-gives-the-ultimate-valentines-day-gift-to-a-complete-stranger.html",
      "source_name": "cleveland.com",
      "published_ts": 1771852892683,
      "image_url": "https://picsum.photos/seed/24/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_026_pet_sanctuary_takes_in_overflow_from_homeless_shelter_amid_u",
      "title": "Pet Sanctuary Takes in Overflow from Homeless Shelter Amid Unprecedented Cold Snap",
      "summary": "When warming shelters in Green Bay hit capacity during a -19°F cold snap, Safe Haven Pet Sanctuary—normally a cat shelter for disabled felines—opened its doors to anyone needing refuge from life-threatening temperatures. A local pastor and her husband are staying overnight to supervise, proving that compassion extends beyond species.",
      "extended_summary": "The thermometer read -19°F overnight, cold enough that a gust of wind could kill an unsheltered person in minutes. Green Bay's warming shelters were turning people away. So Safe Haven Pet Sanctuary, which typically cares for blind and disabled cats, threw open its doors to humans too. \"A cat will warm your heart and your lap, too. Come on in and warm up. All are welcome,\" said board president Joe Becker. A local pastor and her husband volunteered to stay overnight supervising arrivals, turning a small nonprofit into an emergency lifeline when the system failed.",
      "category": "Community",
      "categories": [
        "Community",
        "Rescue",
        "Generosity"
      ],
      "source_url": "https://www.goodnewsnetwork.org/pet-sanctuary-takes-in-overflow-from-homeless-shelter-amid-unprecedented-cold-snap/",
      "source_name": "goodnewsnetwork.org",
      "published_ts": 1771852892683,
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/Courtesy-of-Safe-Haven-pet-sanctuary-in-Green-Bay-Wisconsin.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_027_foster_kids_were_exiting_hospital_in_gowns_following_crisis",
      "title": "Foster kids were exiting hospital in gowns following crisis. A Cleveland nonprofit stepped up to clothe them",
      "summary": "Foster kids were arriving at MetroHealth's clinic in hospital gowns—their clothes too bug-infested or damaged to keep after medical exams. Kathy DiVincenzo's nonprofit Honey From the Rock, Cleveland's first foster care closet, now ensures no child leaves without proper clothing, turning a heartbreaking gap in the system into a dignity-restoring solution.",
      "extended_summary": "A sibling group showed up at their new foster home wearing only hospital gowns and grippy socks. Their clothes had been so filthy and bug-infested that the hospital had no choice but to toss them. It's a scene that plays out regularly at MetroHealth's Foster Care Clinic, where every child entering Cuyahoga County's custody passes through for exams—and sometimes loses the only belongings they had. That's why Kathy DiVincenzo started Honey From the Rock, Cleveland's first foster care closet, providing free clothing, toys, and essentials so kids in crisis don't face their next chapter nearly naked.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Transformation"
      ],
      "source_url": "https://www.cleveland.com/news/2026/02/foster-kids-were-exiting-hospital-in-gowns-following-crisis-a-cleveland-nonprofit-stepped-up-to-clothe-them.html",
      "source_name": "cleveland.com",
      "published_ts": 1771852892683,
      "image_url": "https://picsum.photos/seed/23/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_028_runaway_train_in_gadsden_and_a_heroic_stop",
      "title": "Runaway train in Gadsden and a heroic stop",
      "summary": "In 1890s Gadsden, a runaway locomotive tore through town at full speed with no one at the controls. Retired railroad fireman Doc Hughes, sitting barefoot on his porch, recognized the danger and sprinted to the tracks. He swung aboard, reversed the throttle, and stopped the engine past Cobb City—then calmly drove it back to the rail yard.",
      "extended_summary": "A locomotive came screaming through Gadsden in the early 1890s, throttle wide open, with no engineer and no fireman aboard. The terrifying sound brought people running into the streets, and everyone feared what would happen when it reached the L&N bridge—a combination railroad and vehicle bridge that could mean catastrophic loss of life if a wagon or buggy was in the way. Doc Hughes, a retired African-American railroad fireman, was sitting barefoot on his front porch in East Gadsden when he saw it coming. He instantly understood what was at stake. Hughes sprinted to the tracks and swung aboard the speeding engine, using his years of experience to reverse the throttle. He didn't manage to stop it until past Cobb City, but he did stop it. Then he calmly ran it back to the Ninth Street rail yard and handed it over to the trainmen like it was just another Tuesday.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Human Story",
        "Community"
      ],
      "source_url": "https://gadsdenmessenger.com/runaway-train-in-gadsden-and-a-heroic-stop/",
      "source_name": "gadsdenmessenger.com",
      "published_ts": 1771852892683,
      "image_url": "https://gadsdenmessenger.com/wp-content/uploads/2024/10/Danny-Crownover-2023_WEB-e1767816679345.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_029_iowa_funeral_home_opens_door_to_marry_a_couple_when_judge_no",
      "title": "Iowa Funeral Home Opens Door To Marry A Couple When Judge No Showed",
      "summary": "When a judge failed to show up for a couple's wedding ceremony, an Iowa funeral home stepped in to save the day. The unexpected venue switch turned what could have been a disappointment into a memorable moment—proving that love finds a way, even in the most surprising places.",
      "extended_summary": "A couple in Iowa showed up ready to get married, but their judge never appeared. Just when it looked like their wedding day might fall apart, a local funeral home opened its doors and offered to host the ceremony on the spot. The unexpected venue became the backdrop for vows that might have been delayed or canceled entirely. It's not every day you say \"I do\" in a funeral home, but sometimes the most meaningful moments happen in the places we least expect. The couple got their happily ever after—just with a slightly different setting than planned.",
      "category": "Other",
      "categories": [
        "Other",
        "Community",
        "Surprise"
      ],
      "source_url": "https://krna.com/ixp/712/p/iowa-couple-married-funeral-home/",
      "source_name": "krna.com",
      "published_ts": 1771852892683,
      "image_url": "https://townsquare.media/site/712/files/2026/02/attachment-untitled-design-87-1.jpg?w=1200&q=75&format=natural",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_030_from_10_to_47_cardiac_survival_rates_surge_in_texas_city_tha",
      "title": "From 10% to 47%: Cardiac Survival Rates Surge in Texas City That’s Empowering Citizens to Save Lives",
      "summary": "McKinney, Texas, raised its cardiac arrest survival rate from 10% to 47% in two years by coordinating fire, police, and now residents in rapid AED deployment. The city is becoming one of the nation's first \"4-Minute Cities,\" where an automated defibrillator is never more than four minutes away from anyone who needs it.",
      "extended_summary": "Two years ago in McKinney, Texas, your odds of surviving a cardiac arrest were just 10%—the same grim statistic shared by most U.S. cities. Today, that survival rate has rocketed to 47%, closing in on Seattle's national-leading 50%. The transformation began when Fire Battalion Chief Ben Jones sent a team to train at Seattle's Resuscitation Academy, bringing back a \"chain of survival\" plan: rapid recognition, immediate CPR, fast AED access, and quick transport. McKinney's fire and police departments coordinated their response, and now the city is placing automated external defibrillators directly into neighborhoods, creating one of the nation's first \"4-Minute Cities.\" The goal: an AED within four minutes of any cardiac event, anywhere in the city. Every minute matters—and McKinney is proving that smart coordination saves lives.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Community",
        "Transformation"
      ],
      "source_url": "https://www.goodnewsnetwork.org/cardiac-survival-rates-surge-from-10-to-47pt-in-texas-city-thats-empowering-citizens-to-save-lives/",
      "source_name": "goodnewsnetwork.org",
      "published_ts": 1771852892683,
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/McKinney-Fire-Dept-partners-with-police-to-boost-cardiac-survival-rates-with-AEDs-submitted-by-city.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 3
    },
    {
      "id": "story_031_neenah_man_credits_a_thedacare_nurses_kindness_for_saving_hi",
      "title": "Neenah man credits a ThedaCare nurse’s kindness for saving his life four years ago",
      "summary": "Mike Yonkers was volunteering at ThedaCare Regional Medical Center when chest pressure hit. He sat down outside Cardiac Rehab to catch his breath. That's when flight nurse Erin Rusch, wearing her blue flight suit, stopped and took his pulse. \"You don't look so good,\" she said—and walked him to the ER. He was having a heart attack.",
      "extended_summary": "Mike Yonkers had retired from healthcare sales and was volunteering at ThedaCare Regional Medical Center in Neenah when he felt pressure building in his chest. He sat down right outside the Cardiac Rehab department, thinking he just needed a moment. Then Erin Rusch walked by in her blue flight suit. The former ThedaStar flight nurse stopped, looked at him, and said, \"You don't look so good.\" She took his pulse, then insisted on walking him down the corridor to the Emergency Department. Yonkers was having a heart attack. Four years later, he credits that brief conversation with saving his life. Rusch, now working in the ER, just happened to be in the right place at the right time—and paid attention when it mattered most.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://kfiz.com/neenah-man-credits-a-thedacare-nurses-kindness-for-saving-his-life-four-years-ago/",
      "source_name": "kfiz.com",
      "published_ts": 1771852892683,
      "image_url": "https://kfiz.com/wp-content/uploads/2026/02/f2271a05-e44a-444d-a059-4db015ab9308.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_032_abundant_hospitality_in_a_season_of_cold",
      "title": "Abundant hospitality in a season of cold",
      "summary": "When temperatures in Appleton, Wisconsin, dropped dangerously low, St. Thomas More Parish and other churches provided hot meals, hotel rooms, and laundry services for 76 unhoused neighbors. Volunteer Mike Mailand is careful with his words: \"We don't call them clients. We call them our neighbors.\"",
      "extended_summary": "On a bitterly cold evening in Appleton, Wisconsin, hotel lobby tables filled with simple, warm food: chicken sandwiches, coleslaw, pudding cups, noodle soup. It wasn't fancy. It wasn't meant to be. It was offered without condition to 76 people—men, women, and families—who had been living in cars, camping in the woods, or sleeping on the streets. When temperatures drop below 10 degrees or wind chills become life-threatening, Appleton activates a cold-weather response that includes hotel rooms, food, laundry, transportation, and pastoral presence. St. Thomas More Parish, along with other local churches, coordinates the effort. Volunteer Mike Mailand is intentional about language: \"We don't say clients. We don't say the homeless. We call them our neighbors.\" In a season of brutal cold, that distinction—and the hospitality behind it—feels almost sacramental.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://onmissionmedia.com/abundant-hospitality-in-a-season-of-cold/?utm_source=rss&utm_medium=rss&utm_campaign=abundant-hospitality-in-a-season-of-cold",
      "source_name": "thecompassnews.org",
      "published_ts": 1771852892683,
      "image_url": "https://onmissionmedia.com/wp-content/uploads/2026/02/MJC_9797-scaled.jpeg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    }
  ]
}