{
  "batch_id": "batch_20260222_225549",
  "created_at": "2026-02-22T22:55:49.810155",
  "story_count": 50,
  "stories": [
    {
      "id": "story_001_new_snow_shoveling_site_encourages_residents_to_take_safety",
      "title": "New snow shoveling site encourages residents to take safety into their own hands",
      "summary": "After seeing kids forced into traffic by snow-covered sidewalks, a Marblehead web engineer created Snow Patrol — a simple app where neighbors can flag dangerous uncleared spots and mark them resolved once shoveled. At least 11 people jumped in within days, turning frustration into grassroots action.",
      "extended_summary": "Kids were walking in traffic because bus stops were buried under 2 feet of snow. Ed Lewis grabbed his shovel, cleared a few sidewalks himself, then realized he could do more. Within hours, the web engineer launched Snow Patrol — a free app that lets anyone in Marblehead flag dangerous uncleared spots and mark them resolved once someone shovels. No bylaw requires snow removal in this Massachusetts town, so Lewis turned to neighbors instead. At least 11 people signed on within days, quietly reclaiming their sidewalks one shovel at a time.",
      "category": "Community",
      "categories": [
        "Community",
        "Other"
      ],
      "source_url": "https://marbleheadcurrent.org/2026/02/17/new-snow-shoveling-site-encourages-residents-to-take-safety-into-their-own-hands/",
      "source_name": "marbleheadcurrent.org",
      "published_ts": 1771826205389,
      "image_url": "https://marbleheadcurrent.org/wp-content/uploads/2026/02/Febblizzard-11-SMALL-1.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 3
    },
    {
      "id": "story_002_fast_action_and_group_effort_saves_dog_from_icy_plunge",
      "title": "Fast Action and Group Effort Saves Dog from Icy Plunge",
      "summary": "When Ken Rhoads spotted ripples on the iced-over pond, he found a 150-pound Bernese Mountain dog who'd broken through and couldn't climb out. He and his wife tried a scalloping net but needed more hands — neighbors rushed over, and together they pulled Remi to safety and reunited him with his frantic owner next door.",
      "extended_summary": "Ken Rhoads thought he saw a duck. Then he realized a 150-pound dog was thrashing in freezing water, the ice broken beneath him. Remi, the neighbor's Bernese Mountain dog, had bolted onto the pond and fallen through — his owner was already searching the roads, terrified he'd been hit by a car. Rhoads and his wife grabbed a scalloping net and sprinted to the dock, but Remi was too heavy and too cold to pull himself up. Neighbors heard the commotion and ran over. Together, they hauled the exhausted dog onto solid ground and carried him home, soaked and shivering but alive.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://vineyardgazette.com/news/2026/02/11/fast-action-and-group-effort-saves-dog-icy-plunge",
      "source_name": "vineyardgazette.com",
      "published_ts": 1771826205389,
      "image_url": "https://vineyardgazette.com/sites/default/files/article-assets/main-photos/2026/remi_img_1925.jpg",
      "display_mode": "image",
      "display_reason": "medium image but highly visual story",
      "image_confidence": "medium",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_003_neighborhood_dog_leads_police_to_missing_3yearold_lassie_fou",
      "title": "Neighborhood dog leads police to missing 3-year-old: 'Lassie found him'",
      "summary": "When a 3-year-old went missing in Louisville, neighbors joined police in the search — but it was a local dog who ultimately found the child and led officers straight to him. One sergeant said it best: 'Lassie found him.'",
      "extended_summary": "A 3-year-old vanished in Louisville, and the whole neighborhood turned out to help police search. Officers combed yards and alleys, calling the child's name, when a neighborhood dog started barking and pulling them in a specific direction. The dog wouldn't stop — it kept circling back, insistent, until officers followed. Moments later, they found the missing toddler safe. One sergeant summed it up: 'Lassie found him.' The dog became an instant local hero, and the relieved family got their child back thanks to four legs and a very good nose.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community",
        "Surprise"
      ],
      "source_url": "https://www.wfla.com/news/national/neighborhood-dog-leads-police-to-missing-3-year-old-lassie-found-him/",
      "source_name": "wfla.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/2003/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 5
    },
    {
      "id": "story_004_colorado_police_deliver_food_after_arrest",
      "title": "Colorado Police Deliver Food After Arrest",
      "summary": "A Colorado DoorDash driver got pulled over for expired tags and arrested on an outstanding warrant — mid-delivery. Wheat Ridge police couldn't let the food go to waste, so an officer finished the delivery himself, showing up at the customer's door with their meal and bodycam footage to prove it.",
      "extended_summary": "You order dinner on DoorDash, then wait. And wait. Then a police officer shows up at your door holding your food. That's exactly what happened to one Colorado customer after their delivery driver was pulled over for expired tags and arrested on a warrant. The driver had been cooperative and mid-route, so Wheat Ridge officers did what seemed obvious: one of them grabbed the bag and finished the delivery. 'We wanted to make sure you got the food still,' the officer told the very surprised customer. The department posted bodycam footage of the moment, and the internet loved it.",
      "category": "Humor",
      "categories": [
        "Humor",
        "Community"
      ],
      "source_url": "https://95rockfm.com/ixp/48/p/doordashing-police-delivery/",
      "source_name": "95rockfm.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/48/files/2026/02/attachment-2-515.jpg?w=1200&format=natural",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 5
    },
    {
      "id": "story_005_community_comes_together_to_rescue_trapped_cat_in_brewster",
      "title": "Community Comes Together to Rescue Trapped Cat in Brewster",
      "summary": "A Marshalls employee heard faint cries from a storm drain in Brewster and called for help. Over three days, volunteers, a well company, and a drain service donated time and equipment to camera-search the pipe and finally pull out a trapped cat — cold, scared, but alive.",
      "extended_summary": "A cat was crying somewhere under the Marshalls parking lot in Brewster, trapped in a storm drain on one of the coldest days of January. A store employee heard it and refused to walk away. What followed was a three-day rescue mission involving Putnam AdvoCATS volunteers, a local well company, and a drain service crew — all donating time and equipment. Andrew Evans, who runs a septic service and recently adopted two cats himself, brought a sewer camera to locate the animal deep in a narrow pipe. After hours of careful work, they finally pulled the frightened cat to safety. 'I'm a cat dad,' Evans said. 'It wasn't even a question.'",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.putnampresstimes.com/post/community-comes-together-to-rescue-trapped-cat-in-brewster",
      "source_name": "putnampresstimes.com",
      "published_ts": 1771826205389,
      "image_url": "https://static.wixstatic.com/media/7c6df1_1af412af166a4d22bc5b51c449ab5ead~mv2.jpg/v1/fill/w_1000,h_477,al_c,q_85,usm_0.66_1.00_0.01/7c6df1_1af412af166a4d22bc5b51c449ab5ead~mv2.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_006_dog_rescued_after_43_days_lost_in_the_colorado_rockies",
      "title": "Dog Rescued After 43 Days Lost In The Colorado Rockies",
      "summary": "Rocky, an 11-year-old Lab mix, escaped his harness during a Colorado mountain walk and survived 43 days alone in subzero temps and wolf territory. A nonprofit rescue team finally spotted him — down to half his body weight but still standing — and flew him to California to reunite with his owner.",
      "extended_summary": "Rocky slipped his harness on a Colorado mountain trail and vanished. His owner, mid-move from New Jersey to California, searched until 1 a.m. then had to leave for his new job, heartbroken. For 43 days, the 11-year-old Lab-boxer mix dodged people, cameras, wolves, and subzero nights in the Rockies. He dropped from 50 pounds to 26. Summit Lost Pet Rescue spent weeks tracking sightings until they finally cornered him on February 9 — emaciated, exhausted, but alive. After days of food and medical care, Rocky was flown to California and reunited with his owner. 'He went against all the odds,' the rescuer said.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Surprise"
      ],
      "source_url": "https://cowboystatedaily.com/2026/02/17/new-jersey-dog-rescued-after-43-days-lost-in-the-colorado-rockies/",
      "source_name": "cowboystatedaily.com",
      "published_ts": 1771826205389,
      "image_url": "https://cowboystatedaily.imgix.net/rescued-dog-2-17-26.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_007_from_homeless_to_oru_do_you_believe_god_can_do_the_impossibl",
      "title": "From homeless to ORU: ‘Do you believe God can do the impossible?’",
      "summary": "David Henrique Lima de Oliveira grew up homeless in Brazil, selling sandwiches at bus stops since age six. A stranger once asked him, 'Do you believe God can do the impossible?' Years later, he's now a student at Oral Roberts University — proof that he does.",
      "extended_summary": "At six years old, David sat at a bus stop in Brazil with a cooler of unsold sandwiches, too tired to walk home to the single clay room his family shared behind a stranger's house. An older man sat down and asked him: 'Do you believe God can do the impossible?' David didn't know how to answer. His family had fled rural poverty with nothing, and he'd been working since he could carry food to help them survive. In Brazil's poorest communities, nearly a quarter of kids never finish school. But David kept going. Today, he's a student at Oral Roberts University in Oklahoma — a journey that started with a question he finally learned to answer: yes.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story",
        "Spiritual"
      ],
      "source_url": "https://oruoracle.com/1571/features/from-homeless-to-oru-do-you-believe-god-can-do-the-impossible/",
      "source_name": "oruoracle.com",
      "published_ts": 1771826205389,
      "image_url": "https://oruoracle.com/wp-content/uploads/2026/02/davidheadshot.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_008_it_took_a_village_crews_dig_up_road_to_rescue_manatee_trappe",
      "title": "'It took a village': Crews dig up road to rescue manatee trapped in Florida storm drain",
      "summary": "A juvenile manatee got himself wedged in a storm drain in Melbourne Beach, Florida, and couldn't get out. After an architectural firm employee reported it to wildlife officials, multiple agencies dug up the road, pulled the manatee free, and returned him safely to the water.",
      "extended_summary": "Someone walking past a storm drain in Melbourne Beach heard something big moving inside. They called Florida Fish and Wildlife, and responders discovered a juvenile male manatee trapped underground with no way out. Multiple agencies showed up — wildlife crews, engineers, and construction teams — and started digging up the road. It took coordination, heavy equipment, and a lot of careful maneuvering, but they finally freed the manatee and carried him back to open water. He swam off unharmed. 'It took a village,' one responder said. And in this case, the village brought shovels.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.wfla.com/news/florida/it-took-a-village-crews-in-florida-dig-up-road-to-rescue-manatee-trapped-in-storm-drain/",
      "source_name": "wfla.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/7993/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_009_5_rare_deepsea_creatures_you_wont_believe_exist",
      "title": "5 Rare Deep-Sea Creatures You Won’t Believe Exist",
      "summary": "The king-of-the-salmon isn't actually a salmon — it's a rare ribbonfish that lives 3,000 feet deep and almost never surfaces. But in 2025, a diver spotted a juvenile just 15 feet down in Monterey Bay, only the second recent sighting in the area and a glimpse of one of the ocean's most elusive creatures.",
      "extended_summary": "Most people have seen salmon. Almost no one has seen the king-of-the-salmon — because it's not a salmon at all. It's a silvery ribbonfish that lives around 3,000 feet deep in the twilight zone, where light barely reaches and creatures stay hidden for decades. In 2025, diver Ted Judah was just 15 feet below the surface in Monterey Bay when he spotted a juvenile gliding past — only the second recent Bay Area sighting. Named by the Makah people of the Pacific Northwest, who believed it guided salmon home to spawn, this elusive fish is one of many deep-sea oddities that most of us will never see. The ocean's rarest animals aren't myths — they're just really good at hiding.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Science",
        "Surprise"
      ],
      "source_url": "https://www.mentalfloss.com/animals/rare-deep-sea-creatures?utm_source=RSS",
      "source_name": "mentalfloss.com",
      "published_ts": 1771826205389,
      "image_url": "https://images2.minutemediacdn.com/image/upload/c_crop,x_0,y_58,w_1500,h_843/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/voltaxMediaLibrary/mmsport/mentalfloss/01khpcbp7gj5c4twn8s4.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 3
    },
    {
      "id": "story_010_baby_delivered_in_parking_lot_of_nj_quickchek_on_valentines",
      "title": "Baby delivered in parking lot of N.J. QuickChek on Valentine’s Day",
      "summary": "A New Jersey couple racing to the hospital on Valentine's Day realized they wouldn't make it in time, so they pulled into a QuickChek parking lot and called 911. Officer Antonio Grigoli arrived first and helped deliver a healthy baby boy right there in the car. Mom and baby are doing perfectly.",
      "extended_summary": "Valentine's Day deliveries usually involve flowers or chocolates — not babies. But one New Jersey couple didn't have time to make it to the hospital. Contractions intensified on the drive, so they pulled into a QuickChek parking lot in Old Bridge and dialed 911. Officer Antonio Grigoli got there first and stayed calm as labor progressed in the front seat. Township EMTs arrived moments later and safely delivered a healthy baby boy. Mom and baby were then transported to Jersey Shore University Medical Center, both doing perfectly. Old Bridge EMS posted about it later: 'We can officially say there IS something better than roses or chocolate that can be delivered on Valentine's Day.'",
      "category": "Surprise",
      "categories": [
        "Surprise",
        "Human Story",
        "Community"
      ],
      "source_url": "https://www.nj.com/middlesex/2026/02/baby-delivered-in-parking-lot-of-nj-quickchek-on-valentines-day.html",
      "source_name": "nj.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.nj.com/resizer/v2/LVQFEFPHGZELNEY2HQDYIHE7WY.jpg?auth=75ac2222adc18c1b8d8b50187416c87747c9920458bc8c36e645b5e34d1605f2&width=1280&smart=true&quality=90",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 5
    },
    {
      "id": "story_011_buddy_the_police_therapy_dog_brings_comfort_to_victims_and_o",
      "title": "Buddy The Police Therapy Dog Brings Comfort To Victims And Officers",
      "summary": "Buddy, a 5-year-old black English Lab, serves as a certified therapy dog at Green River Police Department, supporting children and officers experiencing trauma. His handler started the program after noticing rising mental health struggles in the community, turning a college paper into a real-life resource.",
      "extended_summary": "Most mornings, Buddy—a black English Lab—ignores his handler and makes his rounds at the Green River Police Department, settling under desks or waiting outside the chief's office with a tennis ball. He's not a narcotics dog or a patrol canine. He's a certified therapy dog, one of the few in Wyoming law enforcement. His handler, Juvenile Detective Martha Holzgrafe, proposed the program after seeing mental health struggles surge among local kids. What started as a college writing assignment became a living, tail-wagging reality that supports both victims and officers.",
      "category": "Community",
      "categories": [
        "Community",
        "Human Story"
      ],
      "source_url": "https://www.sweetwaternow.com/buddy-the-police-therapy-dog-brings-comfort-to-victims-and-officers/?utm_source=rss&utm_medium=rss&utm_campaign=buddy-the-police-therapy-dog-brings-comfort-to-victims-and-officers",
      "source_name": "sweetwaternow.com",
      "published_ts": 1771826205389,
      "image_url": "https://sweetwaternow.nyc3.cdn.digitaloceanspaces.com/wp-content/uploads/2026/02/2.18.26BuddyTheThrapyDawg.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_012_what_hollywood_can_learn_from_iron_lung",
      "title": "What Hollywood can learn from ‘Iron Lung’",
      "summary": "YouTuber Markiplier's directorial debut 'Iron Lung' grossed $35.2 million on a $3 million budget—11 times its production cost. The claustrophobic submarine thriller, financed entirely by Markiplier, proves creativity matters more than big budgets in an era of $100+ million blockbusters.",
      "extended_summary": "Markiplier's 'Iron Lung' earned $35.2 million from a $3 million budget—a minuscule sum in an industry where $100+ million productions are the norm. The YouTuber financed, directed, and starred in the film, setting most of it inside a claustrophobic submarine with a single screen providing light. That creative constraint didn't limit the movie—it defined it. The film joins a wave of low-budget horror successes proving that inventive storytelling beats massive spending. Hollywood blockbusters might want to take notes.",
      "category": "Surprise",
      "categories": [
        "Surprise",
        "Other"
      ],
      "source_url": "https://ucsdguardian.org/2026/02/17/what-hollywood-can-learn-from-iron-lung/",
      "source_name": "ucsdguardian.org",
      "published_ts": 1771826205389,
      "image_url": "https://ucsdguardian.org/wp-content/uploads/2026/02/Iron-Lung-Art-by-Catherine-Xu-_-The-UCSD-Guardian.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_013_isaac_mwebazemukama_transforms_sustainability_and_youth_empo",
      "title": "Isaac Mwebazemukama Transforms Sustainability and Youth Empowerment in Uganda",
      "summary": "Isaac Mwebazemukama founded Leaf Lives Africa, a youth-led initiative in Uganda focused on sustainable agriculture, environmental conservation, and community empowerment. Inspired by his father—a teacher who educated extended family members—Mwebazemukama aims to create a greener, hunger-free Africa for future generations.",
      "extended_summary": "Isaac Mwebazemukama grew up watching his father, a teacher, ensure that not just his own children but extended family members had access to education. That belief—that education is the key to progress—shaped Mwebazemukama's own path as a social innovator in Uganda. He founded Leaf Lives Africa, a youth-led organization addressing immediate community needs through sustainable agriculture and environmental conservation. The initiative isn't just responding to today's hunger—it's building the foundation for a greener, self-sufficient Africa that future generations can sustain.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://africa.com/isaac-mwebazemukama-transforms-sustainability-and-youth-empowerment-in-uganda/",
      "source_name": "africa.com",
      "published_ts": 1771826205389,
      "image_url": "https://africa.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-at-14-38-44-IMG_5145-1-1050x1400.jpg-JPEG-Image-1050-Ã\u0097-1400-pixels.png",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_014_ut_students_work_behind_the_scenes_at_the_2026_super_bowl",
      "title": "UT students work behind the scenes at the 2026 Super Bowl",
      "summary": "Ten University of Tennessee business students worked behind the scenes at the 2026 Super Bowl through the Big Orange Combine program. The experience gave them real-world networking opportunities and hands-on experience in human resources and sports management alongside industry professionals.",
      "extended_summary": "Ten UT business students didn't watch the 2026 Super Bowl from the stands—they worked it. Through the Big Orange Combine program, they spent game day behind the scenes, networking with hundreds of industry professionals and gaining hands-on experience in human resources and sports management. Faculty advisor Dr. Debra Mackey has overseen the program for over a decade, watching it evolve from a small sports management opportunity into a major experiential learning platform. For these students, the Super Bowl became less about the halftime show and more about stepping outside their comfort zones and building careers.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://utdailybeacon.com/208581/arts-and-culture/ut-students-work-behind-the-scenes-at-the-2026-super-bowl/",
      "source_name": "utdailybeacon.com",
      "published_ts": 1771826205389,
      "image_url": "https://utdailybeacon.com/wp-content/uploads/2026/02/IMG_4075.jpeg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_015_from_heartbreak_to_help_the_story_behind_a_colstrip_nonprofi",
      "title": "From Heartbreak to Help: The Story Behind a Colstrip Nonprofit Changing Lives",
      "summary": "A nonprofit in Colstrip, Montana is making an impact in the community, born from a story of heartbreak. The article provides minimal detail about the organization or its specific work.",
      "extended_summary": "In Colstrip, Montana, a nonprofit called Syd's Wish is changing lives, and it started with heartbreak. The article doesn't provide details about what the organization does or who it serves, but the photo suggests a personal story behind the mission. The name alone—'Syd's Wish'—hints at a tribute or a loss that became a catalyst for community action. Without more context, the full scope of the nonprofit's impact remains unclear, but the emotional origin is central to its identity.",
      "category": "Other",
      "categories": [
        "Other"
      ],
      "source_url": "https://kmhk.com/ixp/109/p/syds-wish-colstrip-montana/",
      "source_name": "kmhk.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/109/files/2026/02/attachment-1-59.jpg?w=1200&format=natural",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_016_astronomers_trace_lost_luna_9_lander_on_moons_surface",
      "title": "Astronomers Trace Lost Luna 9 Lander on Moon's Surface",
      "summary": "Astronomers using AI and advanced imaging may have finally located the Soviet Luna 9 lander, which achieved the first soft landing on the Moon in 1966. The spacecraft's exact resting place has remained a mystery for nearly 60 years, despite its historic transmission of the first close-up photos of the lunar surface.",
      "extended_summary": "After nearly 60 years, the Soviet Luna 9 lander—the first spacecraft to soft-land on the Moon—may have been found. Astronomers leveraged AI and high-resolution imaging to identify an object matching Luna 9's size and shape in the expected landing zone. Luna 9 sent back humanity's first close-up photos of the lunar surface in 1966, proving the Moon's dust wouldn't swallow landers whole. Yet the exact spot where it came to rest has been uncertain ever since, making this rediscovery a resolution to one of space exploration's lingering mysteries.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Science"
      ],
      "source_url": "https://thesheffieldpress.com/astronomers-trace-lost-luna-9-lander-on-moons-surface-mlh5bt4c",
      "source_name": "thesheffieldpress.com",
      "published_ts": 1771826205389,
      "image_url": "https://thesheffieldpress.com/uploads/astronomers-trace-lost-luna-9-lander-on-moons-surface-10d92c-og.webp",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_017_this_mathematician_proved_the_random_walk_theorem_to_clear_h",
      "title": "This mathematician proved the random walk theorem to clear his name as a lurker",
      "summary": "Hungarian mathematician George Pólya kept accidentally running into a student and his fiancée during forest walks over a century ago. To prove he wasn't stalking them, he developed the random walk theorem, demonstrating mathematically that two wanderers are destined to cross paths by chance.",
      "extended_summary": "Over a century ago, George Pólya kept bumping into the same student couple during his solitary forest walks—so many times he feared they'd think he was lurking. To clear his name, the Hungarian mathematician did what any good scientist would: he generalized the problem. He created the random walk theorem, proving mathematically that two wanderers on an infinite grid will inevitably cross paths by pure chance. The theorem became a foundational concept in probability theory—all because Pólya needed to justify his social awkwardness.",
      "category": "Humor",
      "categories": [
        "Humor",
        "Discovery",
        "Science"
      ],
      "source_url": "https://www.scientificamerican.com/article/this-mathematician-proved-the-random-walk-theorem-to-clear-his-name-as-a/",
      "source_name": "scientificamerican.com",
      "published_ts": 1771826205389,
      "image_url": "https://static.scientificamerican.com/dam/m/b174bf202c355c33/original/sa0326Math01.jpg?m=1770410426.763&w=1200",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 5
    },
    {
      "id": "story_018_marysville_couple_give_selflessly_to_kids_anyone_in_need_uns",
      "title": "Marysville couple give selflessly to kids, anyone in need | Unsung Hero",
      "summary": "Teresa and Justin Kerr of Marysville welcomed two more children into their home despite already raising five. Multiple nominators describe them as loving, calm in crisis, and deeply involved in their church and community. The kids they've taken in are treated exactly like their biological children.",
      "extended_summary": "Teresa and Justin Kerr already had five kids at home when they decided to make room for two more. Friends and neighbors say the Marysville couple handles every crisis with grace, leaning on their church and a deep well of faith. The children they've welcomed—Jeremiah and Bella—aren't treated like foster kids or charity cases. They're brothers and sisters now, folded into a bustling household where love stretches to fit everyone. Multiple people nominated the Kerrs for this honor, and the theme is the same: they give selflessly, show up when it matters, and make every child feel like they belong.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://www.seattleschild.com/marysville-couple-give-selflessly-to-kids-anyone-in-need-unsung-hero-teresa-justin-kerr/",
      "source_name": "seattleschild.com",
      "published_ts": 1771826205389,
      "image_url": "https://images.seattleschild.com/wp-content/uploads/2026/02/Kerr-Teresa-and-Justin-e1771278017691.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_019_you_feel_like_youre_really_making_a_difference_organizers_pr",
      "title": "‘You feel like you’re really making a difference:’ Organizers preparing for 41st Annual Benefit Oyster Roast",
      "summary": "Two Virginia churches are hosting their 41st annual oyster roast fundraiser, which has raised $40,000-$60,000 annually in recent years. This year's proceeds will help a single mother in Fauquier County raising a daughter with cerebral palsy. Past recipients say the event saved them from losing their homes.",
      "extended_summary": "Art Blankenship once ran into a family his church's oyster roast had helped years earlier. They told him straight: without that money, they would've lost their home. That's what keeps him coming back. For 41 years, Fairview Baptist and River Club Church have thrown this fundraiser in Fredericksburg, pulling in tens of thousands of dollars to help families buried under medical bills. This year, it's going to a Fauquier County mom raising a daughter with cerebral palsy. Thirty sponsors cover the costs; attendees donate what they can. It's simple, it works, and it's been changing lives for four decades.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community"
      ],
      "source_url": "https://www.fredericksburgfreepress.com/2026/02/18/you-feel-like-youre-really-making-a-difference-organizers-preparing-for-41st-annual-benefit-oyster-roast/",
      "source_name": "fredericksburg.today",
      "published_ts": 1771826205389,
      "image_url": "https://ddrqacl1jpsyp.cloudfront.net/wp-content/uploads/2026/02/18134726/IMG_2881.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_020_lanett_employee_recognized_for_heroic_efforts",
      "title": "Lanett employee recognized for heroic efforts",
      "summary": "A Lanett, Alabama meter reader found a man who had fallen on his front porch and couldn't get up in 25-degree weather. He called 911 immediately. The man later told city officials that without the employee's quick action, the outcome could have been tragic.",
      "extended_summary": "Lane Lauderdale was reading meters on a cold morning in Lanett—25 degrees—when he spotted someone lying motionless on a front porch. The man had fallen and couldn't get up. Lauderdale called 911 right away. Later, the man came to city hall to say thank you, explaining that if Lauderdale hadn't shown up when he did, he likely wouldn't have survived the cold. The city council honored Lauderdale with a proclamation, but the real story is simpler: he was doing his job, noticed something wrong, and acted. That's how lives get saved.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.valleytimes-news.com/news/lanett-employee-recognized-for-heroic-efforts-b38266d0",
      "source_name": "valleytimes-news.com",
      "published_ts": 1771826205389,
      "image_url": "https://public-assets-prod.pubgen.ai/brand_9663c318-8556-4b3e-aa17-33bf5d7ebaea/asset_3cef067f-10ec-4897-8844-6ea29351af47.jpg?w=1200",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 3
    },
    {
      "id": "story_021_child_and_adult_rescued_water_at_belmont_harbor",
      "title": "Child and adult rescued water at Belmont Harbor",
      "summary": "A child and adult fell into Lake Michigan at Chicago's Belmont Harbor. A bystander jumped in and helped both to safety. All three were taken to the hospital.",
      "extended_summary": "At Belmont Harbor, a child and an adult went into Lake Michigan—accidentally, suddenly, and in real danger. A bystander didn't think twice. They jumped in, got to both victims, and kept them afloat until help arrived. All three were pulled out and taken to the hospital. It's the kind of split-second decision most of us hope we'd make but never want to face: cold water, two people struggling, and no time to hesitate. This stranger did it anyway.",
      "category": "Rescue",
      "categories": [
        "Rescue"
      ],
      "source_url": "https://wgntv.com/news/chicago-news/child-and-adult-rescued-water-at-belmont-harbor/",
      "source_name": "cltv.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/259/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_022_alexander_amp_mandaree_boys_basketball_teams_join_in_showing",
      "title": "Alexander &amp; Mandaree Boys Basketball Teams Join In Showing What Great Sportsmanship Means",
      "summary": "During a North Dakota high school basketball game, opposing team Mandaree let injured senior Porter Soiseth score one last basket on his home court. Later, the Alexander coach put freshman Mason Lucas—who has autism and is often bullied—into the game. The Warriors let him score, and both teams erupted in celebration.",
      "extended_summary": "Porter Soiseth hadn't been able to play much of his senior season due to injury, but on Senior Night, the Mandaree Warriors made sure he got his moment. He walked onto the court in a leg brace and shot his last basket at home—his opponents stepping aside to let it happen. Then, in the final minutes, Alexander freshman Mason Lucas checked in. Mason has autism and has faced bullying for years, but basketball is his love. The Warriors let him score. Both benches emptied. The gym exploded. Two acts of sportsmanship in one night, reminding a small town that sometimes winning means making room for someone else's joy.",
      "category": "Community",
      "categories": [
        "Community",
        "Human Story",
        "Sports"
      ],
      "source_url": "HTTPS://www.roundupweb.com/story/2026/02/18/sports/alexander-andamp-mandaree-boys-basketball-teams-join-in-showing-what-great-sportsmanship-means/23776.html",
      "source_name": "roundupweb.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.roundupweb.com/home/cms_data/dfault/photos/stories/id/7/6/23776/s_top",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_023_680000_natural_state_jackpot_winner_to_split_prize_with_frie",
      "title": "$680,000 Natural State Jackpot Winner to Split Prize With Friend",
      "summary": "A North Little Rock man won a $680,000 lottery jackpot and immediately decided to split it evenly with his best friend of decades. The two thought they'd won maybe $1,000—learning the real amount at the lottery office left them stunned. They say they plan to help others and won't change their lifestyles.",
      "extended_summary": "The man walked into the Arkansas Scholarship Lottery office thinking he'd won maybe a grand. Staff told him he'd hit the $680,000 jackpot. At first, he thought they meant $680. When it sank in, he didn't hesitate: he's splitting the entire prize with his best friend, a guy he's been tight with for decades. They'd joked on the drive over about what they'd do with a thousand bucks. Now they're sitting on life-changing money, and their first move is to help other people. No fancy cars, no lifestyle overhaul—just two guys who know what matters.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story",
        "Surprise"
      ],
      "source_url": "https://kygl.com/ixp/152/p/north-little-rock-jackpot-win/",
      "source_name": "kygl.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/152/files/2026/02/attachment-untitled-design-2026-02-16t150243-519.jpg?w=1200&q=75&format=natural",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_024_stronger_after_setbacks_will_russells_road_back_to_states",
      "title": "Stronger after setbacks: Will Russell’s road back to states",
      "summary": "After two season-ending injuries in three years—a broken thumb in ninth grade and a broken collarbone junior year—Manhasset senior wrestler Will Russell qualified for the state championship. His coach visited him at home after surgery, and that support system helped him come back stronger.",
      "extended_summary": "Will Russell broke his thumb in ninth grade, right before the state qualifier. Then he broke his collarbone junior year at Eastern States, watching his season vanish in real time. Most kids would've walked away. Russell put his head down and used the setbacks as fuel. This past weekend, the Manhasset senior finished second at Hofstra and punched his ticket to the state championship. What changed? Maturity, sure—but also his coach showing up at his house after surgery just to check in. Sometimes all it takes is one person proving they believe in you when you're not sure you believe in yourself.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Sports"
      ],
      "source_url": "https://www.longislandpress.com/2026/02/18/stronger-after-setbacks-will-russells-road-back-to-states/",
      "source_name": "massapequaobserver.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.longislandpress.com/wp-content/uploads/2026/02/0206_R6I_0882.jpg?w=1200&p=q",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_025_cranford_man_displays_good_humor_selling_ice_cream_from_a_tr",
      "title": "Cranford man displays ‘good humor’ selling ice cream from a truck made of snow",
      "summary": "A New Jersey man spent 30 hours sculpting a 1953 ice cream truck out of five tons of snow, complete with headlights and a license plate. He's selling Good Humor bars from it for $5 each, raising over $5,000 for a children's hospital where his 104-year-old father once volunteered.",
      "extended_summary": "Robert Schott parked a full-size ice cream truck on his front lawn in Cranford—except it's made entirely of snow. Five tons of it. Thirty hours of carving produced headlights, rims, a front seat, even a license plate reading \"OHSOGOOD.\" He's selling Good Humor bars from the frozen sculpture for five bucks apiece, and people are handing him twenties, fifties, hundreds. The money—over $5,000 so far—goes to Children's Specialized Hospital, where Schott's friend received care and where his 104-year-old father spent years playing checkers with patients and letting them win. It's whimsy with a purpose, and the line wraps around the corner.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Humor"
      ],
      "source_url": "https://njtoday.news/2026/02/17/cranford-man-displays-good-humor-selling-ice-cream-from-a-truck-made-of-snow/",
      "source_name": "njtoday.net",
      "published_ts": 1771826205389,
      "image_url": "https://njtoday.news/wp-content/uploads/2026/02/Robert-Schotts-retrofitted-snow-and-ice-1953-Chevy-truck.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_026_local_brewery_will_discount_its_beer_based_on_how_much_snow",
      "title": "Local brewery will discount its beer based on how much snow falls. They're predicting drafts will sell for 25 cents",
      "summary": "A Philadelphia brewery is dropping its beer price by $1 for every inch of snow that falls this weekend. With 12-18 inches expected, their $8 brew could sell for just 25 cents—the lowest they can go while still covering costs.",
      "extended_summary": "Human Robot brewery in Philly is turning a snowstorm into a party: for every inch that falls, they're knocking a dollar off their TMAVY 13° beer. With up to 18 inches forecast, that $8 pint could drop to a quarter—literally the rock-bottom price co-owner Jake Atkinson says they can manage. It's a playful way to give snow-weary locals something to smile about, proof that a little creativity can turn a blizzard into a reason to gather.",
      "category": "Community",
      "categories": [
        "Community",
        "Humor"
      ],
      "source_url": "https://www.phillyvoice.com/human-robot-beer-snow-discount/?utm_source=pv-rss&utm_medium=rss&utm_campaign=pv-site",
      "source_name": "phillyvoice.com",
      "published_ts": 1771826205389,
      "image_url": "https://media.phillyvoice.com/media/images/Human_robot_snow_deal.2e16d0ba.fill-1200x630-c0.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 5
    },
    {
      "id": "story_027_ogisd_fccla_students_spread_love_with_90_bouquets_at_premier",
      "title": "OGISD FCCLA Students Spread Love with 90 Bouquets at Premiere of Alice Assisted Living",
      "summary": "High school FCCLA students from Orange Grove, Texas prepared and delivered 90 flower bouquets to residents at an assisted living facility on Valentine's Day. They spent time talking and laughing with residents, creating meaningful connections across generations after a week of fulfilling hundreds of carnation orders across their district.",
      "extended_summary": "After a marathon week selling Valentine's carnations across their school district, Orange Grove High's FCCLA students weren't done yet. On Friday the 13th, they walked into Premiere of Alice Assisted Living with 90 bouquets in hand and something even more valuable: time. They sat with residents, talked, laughed, and turned a flower delivery into a real exchange between generations. The residents lit up—not just at the carnations, but at the chance to spend an afternoon with teenagers who cared enough to show up. It was the kind of service project that reminds you kindness doesn't take much, just showing up and paying attention.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community"
      ],
      "source_url": "https://www.alicetx.com/2026/02/17/ogisd-fccla-students-spread-love-with-90-bouquets-at-premiere-of-alice-assisted-living/",
      "source_name": "alicetx.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.alicetx.com/wp-content/uploads/sites/82/2026/02/634863394_1486569666590378_2838357977773123207_n.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_028_paxton_churchs_ceiling_collapses_community_steps_up_to_help",
      "title": "Paxton church's ceiling collapses; community steps up to help",
      "summary": "Pastor Keith Reuther walked into his Paxton, Illinois sanctuary to pray and found a one-ton beam had collapsed from the ceiling. The community immediately stepped up to help the Paxton Evangelical Covenant Church recover from the unexpected disaster.",
      "extended_summary": "Pastor Keith Reuther walked into the sanctuary at Paxton Evangelical Covenant Church to pray, just like he does every week. This time, he found a one-ton beam lying on the floor—it had dropped from the ceiling without warning. The shock of seeing the destroyed sanctuary was overwhelming, but before he could fully process it, the community showed up. Neighbors, church members, and strangers alike rallied to help the Ford County church rebuild. It's the kind of disaster no one sees coming, but in Paxton, it's also the kind of moment that proves people still show up for each other when it matters most.",
      "category": "Community",
      "categories": [
        "Community",
        "Surprise"
      ],
      "source_url": "https://www.wcia.com/news/ford-county/paxton-churchs-ceiling-collapses-community-steps-up-to-help/",
      "source_name": "illinoishomepage.net",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/743/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_029_what_if_we_showed_a_little_more_kindness_in_west_alabama",
      "title": "What If We Showed A Little More Kindness In West Alabama",
      "summary": "A West Alabama writer shares a moment of connection at a traffic light on Skyland Boulevard. He glanced over at a young woman who looked like she was having a terrible day, and in that brief eye contact, he was reminded how much a small gesture of kindness can matter.",
      "extended_summary": "Rushing to an appointment on Skyland Boulevard, the writer wasn't paying attention to anything but his own schedule. Then he stopped at an intersection and glanced right. A young woman sat in the car next to him, and the look on her face told him everything: this was not a good day. He didn't know her story—single mom, work stress, relationship trouble—but he could see she needed something, even if it was just a small gesture of kindness. Their eyes connected for a moment, and he realized how much we all need those tiny acknowledgments that someone sees us. It's a reminder that in a world that feels increasingly short on goodness, sometimes the simplest act is enough.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Community",
        "Generosity"
      ],
      "source_url": "https://wtug.com/ixp/532/p/spreading-kindness-tuscaloosa/",
      "source_name": "wtug.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/532/files/2026/02/attachment-adam-nemeroff-_pdprax9dm8-unsplash.jpg?w=1200&format=natural",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 2
    },
    {
      "id": "story_030_teacher_of_the_month_recognized_for_using_pineapples_and_pos",
      "title": "‘Teacher of the Month’ recognized for using pineapples and positivity to teach persistence in the classroom",
      "summary": "First-grade teacher Courtney Malahais earned the nickname \"Miss Pineapple\" for filling her Anderson Elementary classroom with music, movement, and motivation. Her students—\"persistent pineapples\"—learn that persistence, positivity, and joy are just as important as reading and math.",
      "extended_summary": "Walk into Courtney Malahais' first-grade classroom at Anderson Elementary in Wilmington, North Carolina, and you'll find pineapples everywhere. Not actual fruit—though that would fit the vibe—but a philosophy. Her students call themselves \"persistent pineapples,\" and they learn through music, movement, and motivation that sticking with something hard is how you grow. Malahais, affectionately known as Miss Pineapple, has built her teaching around persistence, positivity, and joy. The kids climb a \"ladder\" of progress, celebrating each step. It's a classroom where first-graders learn that effort matters as much as the answer, and that showing up with a good attitude can change everything.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Community"
      ],
      "source_url": "https://www.wwaytv3.com/teacher-of-the-month-recognized-for-using-pineapples-and-positivity-to-teach-persistence-in-the-classroom/",
      "source_name": "wwaytv3.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.wwaytv3.com/content/uploads/2026/02/z/u/dbfb65082c37c42d05816426de1d933853d26d88_fl9-720p_25.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_031_bountiful_teen_battles_back_from_neardeath_now_competes_to_b",
      "title": "Bountiful teen battles back from near‑death, now competes to become ‘America’s Most Artistic Kid’",
      "summary": "Ledger, a Bountiful teen, nearly died after a baseball struck him in the face at 70 mph, shattering bones and leaving him with a traumatic brain injury. During his brutal recovery in a dark, quiet house, he taught himself to paint—and now he's competing to become 'America's Most Artistic Kid.'",
      "extended_summary": "Four years ago, a 70-mph fastball shattered Ledger's face during a baseball game. The impact broke his nose, fractured facial bones, and caused a traumatic brain injury so severe he almost didn't survive. For months, the 17-year-old sat in darkness and silence—light and sound caused him unbearable pain. Then, one month into his recovery, he picked up a paintbrush and painted two colorful toucans. He kept going: lions, tigers, eagles—animals that reflected the strength he was clawing back into his own life. Now he's in first place in a national art competition created by Bob Ross, vying to become 'America's Most Artistic Kid.' His mom still cries when she talks about how far he's come.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story",
        "Discovery"
      ],
      "source_url": "https://ksltv.com/local-news/americas-most-artistic-kid/879104/",
      "source_name": "ksltv.com",
      "published_ts": 1771826205389,
      "image_url": "https://ksltv.com/wp-content/uploads/2026/02/hero.jpeg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_032_jaden_smith_wants_to_feed_the_unhoused_on_las_skid_row_and_s",
      "title": "Jaden Smith Wants to Feed the Unhoused on L.A.’s Skid Row and Spread Positivity Through His ‘I LOVE YOU’ Brand",
      "summary": "Jaden Smith wants to turn his I LOVE YOU brand into a permanent Skid Row building where he can serve free meals daily to LA's unhoused population. He launched a vegan food truck in 2019 and now dreams of a full HQ that creates jobs, spreads positivity, and eventually expands to other cities.",
      "extended_summary": "Jaden Smith—Grammy-nominated artist, actor, and Louboutin's first men's creative director—has a dream that goes beyond music and fashion. He wants to open a permanent building on Los Angeles' Skid Row where he can serve free breakfast, lunch, and dinner to the nearly 4,000 unhoused people living there. He started with a vegan food truck in 2019 called I Love You Restaurant, but now he's aiming bigger: a full HQ that creates jobs, builds community, and spreads the work to other cities around the world. His merch carries the message: \"Not a volunteer just a person trying to be the change I want to see in the world.\" He's inviting his fans to come on the journey with him, one meal and one act of kindness at a time.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://www.kjwl.com/2026/02/18/jaden-smith-wants-to-feed-the-unhoused-on-l-a-s-skid-row-and-spread-positivity-through-his-i-love-you-brand/",
      "source_name": "kjwl.com",
      "published_ts": 1771826205389,
      "image_url": "https://dehayf5mhw1h7.cloudfront.net/wp-content/uploads/sites/1104/2026/02/18183142/2HpFicp855866.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_033_teen_corner_we_can_be_friends_even_if_we_dont_always_agree",
      "title": "Teen Corner — We can be friends even if we don’t always agree",
      "summary": "Teen columnist Braelynn Smith reflects on how quickly people turn to hatred over differing opinions. She wishes we could disagree on one thing and still be friends, instead of letting a single belief destroy the chance for connection and shared interests.",
      "extended_summary": "Braelynn Smith is tired of watching people hate each other over opinions. In her teen column, she writes about the frustration of seeing potential friendships destroyed before they start—all because two people disagree on one thing, even when they might share a million others. Opinions aren't right or wrong, she argues, they're just thoughts. But somewhere along the way, we started treating differing beliefs like personal attacks. She wishes it were different. She wishes you could say, \"I think this candidate is better because...\" without a mob deciding to hate your entire existence. There's so much unnecessary hatred, she writes, and it breaks her heart that not everyone can just get along.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Community"
      ],
      "source_url": "https://harlanenterprise.net/2026/02/18/teen-corner-we-can-be-friends-even-if-we-dont-always-agree/",
      "source_name": "harlanenterprise.net",
      "published_ts": 1771826205389,
      "image_url": "https://harlanenterprise.net/wp-content/uploads/sites/49/2026/02/Braelynn-Smith.jpg?w=881",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 1,
      "headline_pull": 3
    },
    {
      "id": "story_034_mother_of_3_reunites_with_good_samaritan_after_crashing_into",
      "title": "Mother of 3 reunites with good Samaritan after crashing into canal",
      "summary": "Shyeniqua Wilkins reunited with Casey Curtis, the stranger who pulled her and her three kids from a sinking car after she had a seizure while driving. Her 8-year-old reached the surface and screamed for help, and Curtis turned his car around just in time to save them all.",
      "extended_summary": "Shyeniqua Wilkins doesn't remember crashing into the canal. She was driving when a seizure hit, sending her car plunging into the water with her three kids inside. Her 8-year-old somehow made it to the surface and screamed. Casey Curtis saw the crash in his rearview mirror and didn't hesitate—he turned around, dove in, and pulled all four of them out before the water swallowed the car. Days later, recovering in a hospital bed with her baby girl safe beside her, Wilkins met Curtis face-to-face. \"You're a part of the family now,\" she told him. If he hadn't turned around, she said, none of them would be breathing.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Human Story",
        "Community"
      ],
      "source_url": "https://wsvn.com/news/local/florida/mother-of-3-reunites-with-good-samaritan-after-crashing-into-canal/",
      "source_name": "wsvn.com",
      "published_ts": 1771826205389,
      "image_url": "https://wsvn.com/wp-content/uploads/sites/2/2026/02/021726-Mother-of-3-reunites-with-good-Samaritan-after-crashing-into-canal.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_035_marathon_does_it_again_fundraiser_for_bartender_battling_can",
      "title": "MARATHON DOES IT AGAIN: FUNDRAISER FOR BARTENDER BATTLING CANCER NETS $138K",
      "summary": "The Marathon, Florida community raised over $138,000 for bartender Rachele \"Roach\" Kruse, who's battling cancer. An all-day fundraiser at Island Fish Company featured silent auctions, barbecue plates, and donations, proving once again that the Keys take care of their own.",
      "extended_summary": "When Rachele \"Roach\" Kruse—a bartender everyone in Marathon knows—got a cancer diagnosis, the Florida Keys did what they do best: they showed up. Tables at Island Fish Company overflowed with silent auction items. Barbecue plates sold out. A GoFundMe climbed past $23,000. By the end of the day, the community had raised more than $138,000 to help her fight. It's not the first time Marathon has rallied like this, and it won't be the last. In a place where everyone's a neighbor, a cancer diagnosis doesn't just hit one person—it hits the whole town, and the whole town fights back.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://keysweekly.com/42/marathon-does-it-again-fundraiser-for-bartender-battling-cancer-nets-138k/",
      "source_name": "keysweekly.com",
      "published_ts": 1771826205389,
      "image_url": "https://keysweekly.com/wp-content/uploads/2026/01/IMG_8953-Large.jpeg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_036_meet_harry_an_86yearold_practicing_black_belt",
      "title": "Meet Harry, an 86-year-old practicing black belt",
      "summary": "Harry Ericson, 86, is a second-degree black belt who practices at Junior Taekwondo every week. The \"Junior\" in the name doesn't stop him from showing up and staying sharp, proving age is just a number when it comes to martial arts.",
      "extended_summary": "An 86-year-old doesn't walk into a children's taekwondo studio—unless he's Harry Ericson, a second-degree black belt who refuses to let the word \"Junior\" define his limits. Every week, Harry shows up to practice alongside kids young enough to be his great-grandchildren. He moves through kicks and forms with the discipline of someone who's earned his rank twice over. His presence at Junior Taekwondo is a quiet lesson: mastery doesn't retire, and neither does the drive to keep growing.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story",
        "Sports"
      ],
      "source_url": "https://www.wkbn.com/news/local-news/boardman-news/meet-harry-an-86-year-old-practicing-black-belt/",
      "source_name": "wkbn.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/392/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_037_young_entrepreneur_starts_handmade_in_michigan_cornhole_comp",
      "title": "Young entrepreneur starts handmade in Michigan cornhole company in parents’ basement",
      "summary": "Ross O'Donnell turned a basement hobby into Blast Cornhole, a full-scale cornhole manufacturing business in Michigan. Starting at 17 with leftover lumber, he now runs a factory making custom boards and bags—from Detroit skylines to wedding photos—while his high school side hustle became his full-time dream.",
      "extended_summary": "Ross O'Donnell was 17 when he and his dad built two cornhole sets in their basement—one to keep, one to sell. The second one sold so fast they bought more lumber. Then more. Nine years later, he's running Blast Cornhole out of a 47,900-square-foot factory in Wixom, Michigan, with wood cutters, print rooms, and in-house designers who can turn any idea—pet portraits, wedding photos, team logos—into regulation boards that won't fade in the sun. He never pitched on Shark Tank. He just kept building, one board at a time, until the side hobby swallowed his life in the best possible way.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story",
        "Community"
      ],
      "source_url": "https://www.mlive.com/detroit/2026/02/young-entrepreneur-starts-handmade-in-michigan-cornhole-company-in-parents-basement.html",
      "source_name": "mlive.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.mlive.com/resizer/v2/BSEYD4J6YFAORATWRCZJMGCPZE.jpeg?auth=07e5caaa6e25dd24ce38410fe469b81950ec865ebbb67d4e95c65ad1fc1def1f&width=1280&smart=true&quality=90",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_038_beyond_grateful_south_florida_man_reunites_with_medical_team",
      "title": "‘Beyond grateful’: South Florida man reunites with medical team that saved his life after heart health scare",
      "summary": "Kerry Osborne had a heart attack while driving and told his phone to navigate to the nearest hospital. Dr. Henry Cusnir at HCA Florida Westside Hospital went through his wrist, found the blocked artery, and placed a stint—all while Osborne was awake—saving his life.",
      "extended_summary": "'It's like somebody put a brick in my chest,' Kerry Osborne said, describing his Monday morning drive to work on January 5. He was having a heart attack. While driving, he told his phone to take him to the nearest hospital, which mapped him to HCA Florida Westside Hospital. Within minutes, Dr. Henry Cusnir determined Osborne's heart had a major block—a completely occluded aortic artery. There wasn't time to put him under. The doctor went through Osborne's wrist, navigated to the blocked artery in his heart, and placed a stint, all while Osborne was awake and thinking about his life insurance and passcodes. Months later at their reunion, Osborne is alive, losing weight, and grateful. Cusnir's message: listen to your body and take action.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://wsvn.com/news/local/broward/beyond-grateful-south-florida-man-reunites-with-medical-team-that-saved-his-life-after-heart-health-scare/",
      "source_name": "wsvn.com",
      "published_ts": 1771826205389,
      "image_url": "https://wsvn.com/wp-content/uploads/sites/2/2026/02/21726-Heart-Attack.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_039_dog_crashes_olympics_and_steals_the_show",
      "title": "Dog crashes Olympics and steals the show",
      "summary": "A confident dog crashed the Winter Olympics during a women's cross-country ski team sprint, appearing near the finish line and running alongside skiers toward the line like it belonged there. The four-legged surprise visitor brought pure 'I'm just happy to be here' energy to the competition.",
      "extended_summary": "During Wednesday's qualifications for the women's team sprint at the Winter Olympics, a dog suddenly appeared near the finish line and decided to join the race. The playful pup ran alongside skiers, sprinting toward the finish with the kind of confidence and enthusiasm that every dog owner recognizes—pure 'I'm in' energy. One broadcaster joked, 'We have a visitor. Maybe not a streaker, but we certainly have somebody who wants to be part of the Olympic action.' The moment was exactly what it looked like: a fun-loving dog who saw people running and thought, 'Oh, we're racing? Cool.' It's the kind of wholesome, unexpected joy that made everyone's day a little brighter.",
      "category": "Humor",
      "categories": [
        "Humor",
        "Surprise",
        "Sports"
      ],
      "source_url": "https://kosi101.com/a-dog-crashed-the-olympics-and-totally-stole-the-show/",
      "source_name": "kosi101.com",
      "published_ts": 1771826205389,
      "image_url": "https://kosi101.com/wp-content/uploads/2026/02/GettyImages-2261595147.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_040_everyone_deserves_a_second_chance",
      "title": "Everyone Deserves a Second Chance",
      "summary": "A 12-year-old caught vaping at school turned his life around through Monongalia County Teen Court, where youth volunteers run peer-based hearings for first-time offenders. Within a year, his grades improved 40% and he's now excited to study music in high school.",
      "extended_summary": "The 12-year-old had a history of defiant behavior, academic struggles, and was around drug users when he was cited for underage tobacco possession. Then he went through Monongalia County Teen Court, where something unusual happened: he stood before a courtroom run entirely by his peers. Teen attorneys, jurors, bailiffs, and clerks—all volunteers trained by local legal professionals—heard his case and determined his sentence. Less than a year later, his report card shows mostly As and Bs, a 40% improvement. He's excited to start high school and study music. Since 2018, Teen Court has offered local youth a chance to take control of their futures, proving that sometimes the best judges are the ones who understand what it's like to make mistakes.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://morgantownmag.com/everyone-deserves-a-second-chance/?utm_source=rss&utm_medium=rss&utm_campaign=everyone-deserves-a-second-chance",
      "source_name": "morgantownmag.com",
      "published_ts": 1771826205389,
      "image_url": "https://morgantownmag.com/wp-content/uploads/MonCountyTeenCourt4-scaled.jpeg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_041_months_after_receiving_lifesaving_kidney_donation_bayside_ma",
      "title": "Months after receiving life-saving kidney donation, Bayside man is working to help others find donors and spread awareness",
      "summary": "Marc Perez used social media to find a kidney donor after entering Stage 5 kidney failure, receiving his life-saving transplant last October. Now the 41-year-old Bayside resident is helping others in similar situations get their messages out to reach potential donors.",
      "extended_summary": "Diagnosed with advanced IgA Nephropathy in 2009, Marc Perez watched his kidney function decline for years. By October 2023, he hit Stage 5 kidney failure—below 15% function—and was hospitalized for two weeks. Starting dialysis in September 2024 meant 15 grueling hours across three days a week, with a typical two-to-four-year wait for a transplant ahead. Then social media changed everything. His posts reached someone willing to donate, and he received his transplant in October. 'I get a second chance to finish what I started,' said Perez, who turned 41 in February. Now he's working to help others find donors the same way, spreading awareness and helping people get their messages out. 'The second half of my life is starting, and I'm extremely grateful.'",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Transformation",
        "Human Story",
        "Community"
      ],
      "source_url": "https://qns.com/2026/02/life-saving-kidney-donation-bayside-man-help-other/",
      "source_name": "qns.com",
      "published_ts": 1771826205389,
      "image_url": "https://qns.com/wp-content/uploads/2026/02/IMG_0871-e1771360463655.jpg?quality=51&w=1200&p=q",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_042_one_child_three_adults_rescued_from_icy_water_at_glenwood_la",
      "title": "One Child, Three Adults Rescued From Icy Water At Glenwood Lake Park",
      "summary": "Quick-thinking firefighters pulled three adults from icy waters at Glenwood Lake after they broke through thin ice while rescuing a 9-year-old boy who had fallen in on his scooter. First responders threw ropes to the adults struggling in 8-10 feet of water, bringing everyone safely to shore despite the ice continuing to break beneath them.",
      "extended_summary": "Three adults broke through thin ice and plunged into 8-10 feet of freezing water while trying to save a 9-year-old boy at Glenwood Lake Park. The child had been riding his scooter around the park when he decided to explore the lake's melting ice. Fire Chief Matt Gray and his team arrived to find the boy already pulled from the water, but the three rescuers were struggling 15-20 feet from shore as the ice kept breaking beneath them. Firefighters in ice rescue suits threw lines and pulled all three to safety. Despite the close call, everyone refused medical treatment and walked away from what could have been a tragedy.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://opinion-tribune.com/news/one-child-three-adults-rescued-icy-water-glenwood-lake-park",
      "source_name": "opinion-tribune.com",
      "published_ts": 1771826205389,
      "image_url": "https://opinion-tribune.com/sites/default/files/styles/article/public/field/image/GFD.jpg?itok=yUiXMjru",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "low",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_043_how_to_stay_motivated_when_youre_a_team_of_one",
      "title": "How to stay motivated when you’re a team of one",
      "summary": "A solopreneur shares strategies for staying motivated while working alone, including designing a personalized workday, time-blocking, and finding ways to combat the isolation that nearly half of self-employed professionals experience. The key is creating your own structure and working during your most productive hours.",
      "extended_summary": "Working remotely since 2006, this solopreneur transitioned from constant colleague calls to days spent mostly alone. While the freedom is great, staying motivated requires intentional structure. According to a 2025 Leapers report, nearly half of self-employed professionals feel lonely occasionally or some of the time, and one in five feels isolated often or always. The solution? Design your own workday around when you're most productive—early mornings and traditional school hours in this case, ending around 3:30 or 4 p.m. when energy dips. Time-blocking and creating rituals help replace the natural structure that comes with office life. It's about being thoughtful with how you work when no one else is around to keep you on track.",
      "category": "Other",
      "categories": [
        "Other"
      ],
      "source_url": "https://www.fastcompany.com/91486899/how-to-stay-motivated-when-youre-a-team-of-one",
      "source_name": "fastcompany.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/1941/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 1,
      "headline_pull": 2
    },
    {
      "id": "story_044_permit_yourself_others_to_do_new_things_imperfectly",
      "title": "Permit yourself, others to do new things imperfectly",
      "summary": "A college editor reflects on watching someone play Minecraft for the first time and realizes that expecting perfection at new activities is discouraging. Research shows perfectionism can paralyze future efforts, while embracing imperfection facilitates learning and opens doors to new experiences.",
      "extended_summary": "Watching a YouTuber in his late 20s play Minecraft for the first time was hilarious to this college editor—until she remembered her own first time, when she couldn't figure out how to open a door. The realization hit: no one is perfect at something new, so why do we expect ourselves or others to be? According to Gifted Education International, perfectionism can 'paralyze future efforts,' replacing enjoyment with fear of doing it wrong. But a Columbia Zuckerman Institute study on mice shows that novelty facilitates learning and enables new experiences. The takeaway? Expect to do things wrong when trying something new—and be okay with it. The risk of imperfection is worth the reward of learning.",
      "category": "Other",
      "categories": [
        "Other"
      ],
      "source_url": "https://baylorlariat.com/2026/02/17/permit-yourself-others-to-do-new-things-imperfectly/",
      "source_name": "baylorlariat.com",
      "published_ts": 1771826205389,
      "image_url": "https://baylorlariat.com/wp-content/uploads/2026/02/Arden-Berry-12-2048x1366-1.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 1,
      "headline_pull": 2
    },
    {
      "id": "story_045_see_the_good_douglas_runner_becomes_first_person_with_artifi",
      "title": "SEE THE GOOD: Douglas runner becomes first person with artificial heart valve to run all 6 major marathons",
      "summary": "Ed Barnes had open heart surgery and an artificial heart valve as a high school sophomore, but that didn't stop him from becoming the first person with his condition to complete all six major marathons. He now mentors younger cardiac patients through Abbott Heartmates, showing them what's possible after heart surgery.",
      "extended_summary": "When Ed Barnes was a sophomore in high school, he underwent open heart surgery and received an artificial heart valve. The recovery was long, but he refused to let it define his limits. After watching his cousin run the Boston Marathon following brain surgery, Barnes decided to push his own boundaries. He went on to complete all six major marathons—the first person with an artificial heart valve to do so. Now he mentors the next generation of cardiac patients through Abbott Heartmates, walking into huddles with young people facing heart surgery and showing them that 'things are going to be okay.' His message: listen to your doctor, learn your limitations, then keep pushing—you might surprise yourself.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Sports",
        "Human Story"
      ],
      "source_url": "https://whdh.com/news/see-the-good-douglas-runner-becomes-first-person-with-artificial-heart-valve-to-run-all-6-major-marathons/",
      "source_name": "whdh.com",
      "published_ts": 1771826205389,
      "image_url": "https://whdh.com/wp-content/uploads/sites/3/2026/02/021826-douglas-runner.jpg?quality=60&strip=color",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 5
    },
    {
      "id": "story_046_surfers_rescue_family_of_six_after_their_boat_capsizes",
      "title": "Surfers Rescue Family Of Six After Their Boat Capsizes",
      "summary": "Surfers including two 14-year-olds paddled out to rescue a family of six after their boat capsized while trying to outrun large waves. Ian Anderson and Emilio Puhve were among the group who immediately responded when the boat overturned in front of them.",
      "extended_summary": "A boat carrying a family of six tried to outrun big waves—and lost. The vessel capsized, throwing everyone into the water as surfers watched from shore. Without hesitation, the surfers paddled out, including 14-year-olds Ian Anderson and Emilio Puhve. They reached the family quickly, pulling each member to safety before emergency responders arrived. The entire rescue was captured on camera, showing the surfers' quick thinking and calm under pressure as they turned a day at the beach into a life-saving mission.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.kfqd.com/surfers-rescue-family-of-six-after-their-boat-capsizes/",
      "source_name": "kfqd.com",
      "published_ts": 1771826205389,
      "image_url": "https://www.alphamediahub.com/wp-content/uploads/2026/02/0-63.jpg?icb=1771825935",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_047_trooper_saves_infant_on_valentines_day",
      "title": "Trooper Saves Infant On Valentines Day",
      "summary": "Maryland State Trooper Nicholas Warren saved a choking infant on Valentine's Day after a panicked driver pulled up to his patrol car. He immediately performed back blows, clearing the obstruction and restoring the baby's breathing before emergency services arrived.",
      "extended_summary": "Trooper Nicholas Warren was finishing a routine traffic stop near Elkton, Maryland, on Valentine's Day morning when a car pulled alongside him. The driver rolled down the window and yelled that their baby was choking. Warren didn't wait for backup. He called for EMS and took the infant into his arms, performing back blows exactly as he'd been trained. Within moments, the obstruction cleared and the baby started breathing again. Emergency responders arrived shortly after to evaluate the infant, but Warren's swift action had already prevented what could have been a tragedy.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://firststateupdate.com/2026/02/trooper-saves-infant-on-valentines-day/",
      "source_name": "firststateupdate.com",
      "published_ts": 1771826205389,
      "image_url": "https://firststateupdate.com/wp-content/uploads/2023/08/image-65.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_048_pitt_meadows_school_creates_kindness_cards_for_people_in_nee",
      "title": "Pitt Meadows school creates kindness cards for people in need",
      "summary": "Students at Edith McDermott Elementary created 78 kindness cards for clients at the Salvation Army as part of a Pink Shirt Day competition. The initiative has spread to two more schools, with students discovering they can make an impact beyond classroom walls.",
      "extended_summary": "Under teacher Kaitlyn Brett's guidance, students at Edith McDermott Elementary made 78 handmade kindness cards—each with its own positive message—and delivered them to people in need at the Salvation Army Ridge Meadows Ministry on Friday, Feb. 13. The cards, decorated with hearts and paper shirts, were part of a Kindness Card Competition leading up to Pink Shirt Day. Brett wanted her students to learn they could create impact outside the school walls. The project caught on: two other schools, Davie Jones Elementary and Blue Mountain Elementary, have now joined the challenge to create even more cards for people who need a reminder that someone cares.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community"
      ],
      "source_url": "https://mapleridgenews.com/2026/02/17/pitt-meadows-school-creates-kindness-cards-for-people-in-need/",
      "source_name": "mapleridgenews.com",
      "published_ts": 1771826205389,
      "image_url": "https://mapleridgenews.com/wp-content/uploads/sites/5/2026/02/41605725_web1_260217-MRN-CF-cards-SalvationArmy-PinkShirt-EdithMcDermott_2.jpg?w=1024",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_049_woman_rescued_from_the_deepest_cave_in_texas",
      "title": "Woman Rescued from the Deepest Cave in Texas",
      "summary": "A researcher was rescued from 470 feet underground in Sorcerer's Cave, the deepest cave in Texas, after a falling rock injured her. Rescue crews navigated narrow passages with names like 'Poltergeist Pit' and 'Demon Drop' to bring her to safety. She's now in stable condition at an Odessa hospital.",
      "extended_summary": "A researcher exploring Sorcerer's Cave—the deepest cave in Texas at 579 feet—was 470 feet underground when a dislodged rock struck her. Rescue crews had to navigate tight, intimidating passages with names like 'Poltergeist Pit' and 'Demon Drop' to reach her. The grueling extraction brought her back to the surface, where she was airlifted to a hospital in Odessa and is now in stable condition. The cave sits on private property in Terrell County, and the landowner rarely grants access—a reminder of the risks inherent in deep underground exploration.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://1023thebullfm.com/ixp/175/p/sorcerers-cave-rescue-texas/",
      "source_name": "1023blakefm.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/175/files/2026/02/attachment-gettyimages-450471544.jpg?w=1200&format=natural",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_050_neenah_man_credits_a_thedacare_nurses_kindness_for_saving_hi",
      "title": "Neenah man credits a ThedaCare nurse’s kindness for saving his life four years ago",
      "summary": "A volunteer at ThedaCare Regional Medical Center was having a heart attack when flight nurse Erin Rusch stopped to check on him and walked him to the emergency department. Four years later, Mike Yonkers credits that brief encounter with saving his life and now mentors others recovering from cardiac surgery.",
      "extended_summary": "Mike Yonkers was sitting outside the Cardiac Rehab department, struggling to breathe, when a woman in blue stopped and said, 'You don't look so good.' She took his pulse, then insisted on walking him to the emergency department several yards down the corridor. He was having a heart attack. The woman was Erin Rusch, a ThedaStar flight nurse who trusted her instincts and refused to let Yonkers dismiss his symptoms. Four years later, he's running marathons and mentoring younger cardiac patients through Abbott Heartmates, living proof that quick intervention and refusing to ignore warning signs can change everything.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://kfiz.com/neenah-man-credits-a-thedacare-nurses-kindness-for-saving-his-life-four-years-ago/",
      "source_name": "kfiz.com",
      "published_ts": 1771826205389,
      "image_url": "https://kfiz.com/wp-content/uploads/2026/02/f2271a05-e44a-444d-a059-4db015ab9308.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    }
  ]
}