{
  "batch_id": "batch_20260224_150049",
  "created_at": "2026-02-24T15:00:49.636720",
  "story_count": 50,
  "stories": [
    {
      "id": "story_019_north_carolina_amazon_driver_from_charlotte_donates_entire_1",
      "title": "North Carolina Amazon Driver From Charlotte Donates Entire $10,000 Reward to Local Children’s Hospital After Receiving Record Customer Thanks",
      "summary": "After being recognized as one of Amazon's most-thanked drivers, Charlotte-based delivery driver GreyIon Anthony made headlines by donating his entire $10,000 reward to a local children's hospital. His selfless act of generosity highlights the impact of kindness and community support, inspiring others to give back.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://saludastandard-sentinel.com/north-carolina-amazon-driver-from-charlotte-donates-entire-10000-reward-to-local-childrens-hospital-after-receiving-record-customer-thanks/",
      "source_name": "saludastandard-sentinel.com",
      "published_ts": 1769362652000,
      "image_url": "https://saludastandard-sentinel.com/wp-content/uploads/2026/01/North-Carolina-Amazon-Driver-From-Charlotte-Donates-Entire-10000-Reward-to-Local-Childrens-Hospital-After-Receiving-Record-Customer-Thanks.jpg"
    },
    {
      "id": "story_023_man_goes_from_homelessness_to_helping",
      "title": "Man goes from homelessness to helping",
      "summary": "Alexander Amstutz, once homeless, has transformed his life and is now a beacon of hope for fellow veterans as a peer support specialist. At the VA Clinic, he uses his own experiences to guide others through their recovery journeys. This story highlights the power of connection and support in overcoming life's challenges, showing that sometimes the best way to heal is to help others.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://www.tribtoday.com/news/local-news/2026/01/man-goes-from-homelessness-to-helping/",
      "source_name": "tribtoday.com",
      "published_ts": 1769432442000,
      "image_url": "https://ogden_images.s3.amazonaws.com/www.tribtoday.com/images/2026/01/25222151/VA-PEER-SUPPORT2-web-375x500.jpg"
    },
    {
      "id": "story_003_albertus_magnus_students_send_letters_with_love",
      "title": "Albertus Magnus Students Send “Letters With Love”",
      "summary": "What started as senior JohnCarlo Mandara making Valentine's cards for isolated elderly residents has grown into Letters with Love, a certified nonprofit with 100+ participants. The organization has delivered over 1,500 handwritten cards to addiction recovery patients, nurses, hospitalized children, farmers, teachers, and bus drivers—each one hand-delivered with care.",
      "extended_summary": "JohnCarlo Mandara wanted to combat loneliness during Valentine's Day, so he started making cards for senior citizens in care facilities who rarely get visitors. One year later, that simple act of kindness has become Letters with Love, a certified nonprofit with more than 100 participants and over 1,500 handwritten cards delivered. Each month focuses on a different group: people in addiction recovery, nurses, hospitalized children, farmers, teachers, and even bus drivers. Fellow Albertus Magnus senior Antonella Caraballo Pelaez joined after seeing how overwhelmed Mandara was managing it all, and now serves as his second-in-command. Every card is handmade, and every card is personally delivered—because knowing someone took the time to write changes everything.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community",
        "Human Story"
      ],
      "source_url": "https://rocklandtimes.com/2026/02/12/albertus-magnus-students-send-letters-with-love/",
      "source_name": "rocklandtimes.com",
      "published_ts": 1771852892682,
      "image_url": "https://rocklandtimes.com/wp-content/uploads/2026/02/10EB2E00-6C46-48B8-B3CA-FDCF5CB4C913-525x700.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_009_downtown_church_takes_rare_step_amid_cold_opens_doors_as_ove",
      "title": "Downtown church takes rare step amid cold, opens doors as overnight shelter",
      "summary": "In a remarkable act of compassion, St. Paul’s Cathedral in London opened its doors as an overnight shelter for the homeless during a severe cold snap. This historic cathedral, known for its community outreach, welcomed around 50 individuals seeking warmth and safety, showcasing the power of community support in times of need.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://lfpress.com/news/local-news/downtown-church-takes-rare-step-amid-cold-opens-doors-as-overnight-shelter",
      "source_name": "lfpress.com",
      "published_ts": 1769374455000,
      "image_url": "https://smartcdn.gprod.postmedia.digital/lfpress/wp-content/uploads/2026/01/Ldn20260126MH0197-copy.LF_.jpg"
    },
    {
      "id": "story_039_200k_bikes_200k_readers_cycle_rewrites_kids_futures_one_bike",
      "title": "200K bikes, 200K readers: CYCLE rewrites kids’ futures one bike at a time",
      "summary": "CYCLE is making a significant impact in Houston by linking literacy growth to the joy of receiving a bicycle. Celebrating the distribution of its 200,000th bike, the organization rewards students in Title I schools for meeting reading goals. This initiative not only promotes literacy but also instills valuable lessons about hard work and achievement, helping to rewrite the futures of countless children.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://defendernetwork.com/news/education/cycle-literacy-growth-bikes/",
      "source_name": "defendernetwork.com",
      "published_ts": 1769115260000,
      "image_url": "https://defendernetwork.com/wp-content/uploads/2026/01/ascfdav.png"
    },
    {
      "id": "story_001_a_passing_angel_rescues_woman_8months_pregnant_from_her_sink",
      "title": "A Passing ‘Angel’ Rescues Woman 8-Months Pregnant from Her Sinking Car",
      "summary": "On her 29th birthday, eight-months-pregnant Shedly Appolon lost control of her car on I-95 and plunged into a pond. As water filled the cabin and doors wouldn't budge, Logan Hayes dove in and opened the back door just before it submerged. Appolon called him her angel—and for good reason.",
      "extended_summary": "Shedly Appolon was eight months pregnant and celebrating her 29th birthday when sudden dizziness sent her car tumbling off I-95 into a Martin County pond. Water seeped through the floor as the vehicle tilted forward, doors sealed shut by the pressure. Her panicked call to her fiancé cut off just as she realized she was trapped. That's when Logan Hayes stripped off his jacket, sprinted to the water's edge, and swam to the sinking car. He yanked open the back door seconds before it disappeared beneath the murky surface, pulling Appolon to safety. She calls him her angel—a stranger who showed up at exactly the right moment.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Surprise",
        "Human Story"
      ],
      "source_url": "https://www.goodnewsnetwork.org/a-passing-angel-rescues-woman-8-months-pregnant-from-her-sinking-car/",
      "source_name": "goodnewsnetwork.org",
      "published_ts": 1771852892682,
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/Pregnant-woman-saved-from-Florida-crash-Courtesy-of-Shedly-Appolon-and-the-Martin-County-Fire-Rescue.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_001_new_snow_shoveling_site_encourages_residents_to_take_safety",
      "title": "New snow shoveling site encourages residents to take safety into their own hands",
      "summary": "After seeing kids forced into traffic by snow-covered sidewalks, a Marblehead web engineer created Snow Patrol — a simple app where neighbors can flag dangerous uncleared spots and mark them resolved once shoveled. At least 11 people jumped in within days, turning frustration into grassroots action.",
      "extended_summary": "Kids were walking in traffic because bus stops were buried under 2 feet of snow. Ed Lewis grabbed his shovel, cleared a few sidewalks himself, then realized he could do more. Within hours, the web engineer launched Snow Patrol — a free app that lets anyone in Marblehead flag dangerous uncleared spots and mark them resolved once someone shovels. No bylaw requires snow removal in this Massachusetts town, so Lewis turned to neighbors instead. At least 11 people signed on within days, quietly reclaiming their sidewalks one shovel at a time.",
      "category": "Community",
      "categories": [
        "Community",
        "Other"
      ],
      "source_url": "https://marbleheadcurrent.org/2026/02/17/new-snow-shoveling-site-encourages-residents-to-take-safety-into-their-own-hands/",
      "source_name": "marbleheadcurrent.org",
      "published_ts": 1771826205389,
      "image_url": "https://marbleheadcurrent.org/wp-content/uploads/2026/02/Febblizzard-11-SMALL-1.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 2,
      "headline_pull": 3
    },
    {
      "id": "story_002_as_he_battles_cancer_richard_dibella_drives_others_to_treatm",
      "title": "As He Battles Cancer, Richard DiBella Drives Others to Treatment",
      "summary": "Mt. Lebanon lawyer Richard DiBella once donated a kidney to a sick child. Now, while battling his own cancer, he drives cancer patients to treatment through the American Cancer Society's Road to Recovery program. Some passengers talk, some stay silent—DiBella accommodates whatever they need. \"As long as I can drive, I'll keep doing it,\" he says.",
      "extended_summary": "Richard DiBella donated a kidney years ago to a sick child—he jokes that while he's never been to Hawaii, his kidney has. Now the Mt. Lebanon lawyer is fighting his own cancer, but that hasn't stopped him from volunteering as a driver for the American Cancer Society's Road to Recovery program. At least once a week, he chauffeurs patients to their medical appointments, offering companionship during those long, emotionally charged drives. Some passengers use the time like a therapy session. Others prefer silence. DiBella is fine with either. Transportation barriers are the number one reason people miss life-saving treatments, and he's determined to remove that obstacle for as many people as he can. \"As long as I can drive,\" he says, \"I'll keep doing it.\"",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story",
        "Transformation"
      ],
      "source_url": "https://www.pittsburghmagazine.com/acs-road-to-recovery-program/",
      "source_name": "pittsburghmagazine.com",
      "published_ts": 1771852892682,
      "image_url": "https://www.pittsburghmagazine.com/content/uploads/2026/02/j/q/roadtorecovery2.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_004_township_commends_elizabeth_ross_who_overcame_a_physical_dis",
      "title": "Township Commends Elizabeth Ross, Who Overcame a Physical Disability to Pull a Third Grader Out of a Lake Where He Had Fallen Through the Ice, and Her 11-Year-Old, Skylar, Who Recognized the Deep Trouble He Was in",
      "summary": "Elizabeth Ross has lived with rheumatoid arthritis for 20 years and had just finished her monthly infusion therapy when her daughter Skylar alerted her to a child who'd fallen through the ice. Without hesitation, Elizabeth overcame her disability to pull the third grader from the freezing lake. Medford Township honored the mother-daughter duo as real-life superheroes.",
      "extended_summary": "On January 20, Elizabeth Ross was having what she calls \"my worst day of the month\"—she'd just finished infusion therapy for the rheumatoid arthritis that's plagued her for two decades. That's when her 11-year-old daughter Skylar spotted one of her schoolmates, a third grader, who had fallen through the ice on their neighborhood lake. Without a second thought about her physical limitations, Elizabeth sprang into action with almost superhuman strength and agility, pulling the child from the frigid water and saving his life. Medford Township Mayor Michael Czyzyk presented the mother-daughter team with a proclamation of \"gratitude and admiration,\" calling them real-life superheroes. Elizabeth's message: when someone needs help, your body finds a way.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://www.pinebarrenstribune.com/articles/featured-stories/township-commends-elizabeth-ross-who-overcame-a-physical-disability-to-pull-a-third-grader-out-of-a-lake-where-he-had-fallen-through-the-ice-and-her-11-year-old-skylar-who-recognized-the-deep-trou/",
      "source_name": "pinebarrenstribune.com",
      "published_ts": 1771852892682,
      "image_url": "https://www.pinebarrenstribune.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-191156-1200x628.png",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_005_nelson_donates_kidney_to_cousin_huge_gift",
      "title": "Nelson donates kidney to cousin: ‘Huge gift’",
      "summary": "Lacey Nelson made a life-changing decision when she donated a kidney to her cousin, Max Amsden, who was facing end-stage kidney failure. Despite not having seen him for years, Lacey’s willingness to help demonstrates the power of family bonds and the incredible impact of selfless acts. Her journey from blood donation to organ donation showcases the profound generosity that can exist within families, reminding us of the importance of connection and support in times of need.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://www.journalnd.com/articles/homepage-slider/nelson-donates-kidney-to-cousin-huge-gift/",
      "source_name": "journaltrib.com",
      "published_ts": 1768973400000,
      "image_url": "https://www.journalnd.com/wp-content/uploads/images/2026-01-21/3p1-1200x628.jpg"
    },
    {
      "id": "story_008_the_accidental_brilliance_of_bizarre_bazaar",
      "title": "The accidental brilliance of Bizarre Bazaar",
      "summary": "What started as a radical email proposal from Joyce Spiller became the Community Assistance League's Bizarre Bazaar, a year-round resale store. After membership voted to proceed in early 2006 despite leadership concerns, the store opened three months later in Ponderay. Built on $29,000 in reserves from annual fundraisers, it now returns roughly $250,000 annually to the community.",
      "extended_summary": "Joyce Spiller sent an email proposing a year-round resale store to handle leftover donations from the Community Assistance League's 2005 rummage sale. Then she left town. A small group studied the idea, ran numbers, found locations—and the board presented it to membership expecting nothing to happen. Instead, Janet Rogers shouted out a motion, members voted yes with only one dissent, and three months later Bizarre Bazaar opened in Ponderay. It wasn't reckless: CAL had built $29,000 in reserves through reliable fundraisers like their annual rummage sale. That foundation turned into a self-sustaining enterprise now returning roughly $250,000 per year to the community. Sometimes the best ideas start with an email and a leap of faith.",
      "category": "Community",
      "categories": [
        "Community",
        "Transformation",
        "Generosity"
      ],
      "source_url": "https://sandpointreader.com/the-accidental-brilliance-of-bizarre-bazaar/",
      "source_name": "sandpointreader.com",
      "published_ts": 1771852892682,
      "image_url": "https://sandpointreader.com/wp-content/uploads/2024/10/KathrynLarson-WEB.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_024_columbia_falls_runners_complete_24hour_runathon_to_support_i",
      "title": "Columbia Falls runners complete 24-hour run-a-thon to support injured teammate",
      "summary": "The Columbia Falls High School cross country team has come together in an inspiring show of support for their injured teammate, Hazel Alexander. They organized a 24-hour run-a-thon to raise funds for her recovery after a serious accident. This event not only showcases their dedication to Hazel but also highlights the strength of community spirit and the lengths friends will go to support one another in tough times.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://www.kpax.com/news/local-news/flathead-county/columbia-falls-runners-complete-24-hour-run-a-thon-to-support-injured-teammate",
      "source_name": "kpax.com",
      "published_ts": 1769429562000,
      "image_url": "https://ewscripps.brightspotcdn.com/dims4/default/007bda1/2147483647/strip/true/crop/4284x2249+0+1731/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fe0%2F18%2Fc5cced0149fab717ee18dfbfc4a0%2Fimg-0129.jpeg"
    },
    {
      "id": "story_027_owners_of_san_francisco_restaurants_offer_housing_to_employe",
      "title": "Owners of San Francisco restaurants offer housing to employees",
      "summary": "In a heartening initiative, the owners of Rich Table in San Francisco are offering housing to their employees. By renting out furnished apartments at reduced rates, they are addressing the housing crisis while showing genuine care for their staff. This thoughtful approach not only supports their employees but also sets a positive example for other businesses in the community.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community"
      ],
      "source_url": "https://www.nbcbayarea.com/news/local/owners-sf-restaurant-housing-employees/4019135/",
      "source_name": "nbcbayarea.com",
      "published_ts": 1769101743000,
      "image_url": "https://media.nbcbayarea.com/2026/01/45270473783-1080pnbcstations.jpg?quality=85&strip=all&resize=1200%2C675"
    },
    {
      "id": "story_032_abundant_hospitality_in_a_season_of_cold",
      "title": "Abundant hospitality in a season of cold",
      "summary": "When temperatures in Appleton, Wisconsin, dropped dangerously low, St. Thomas More Parish and other churches provided hot meals, hotel rooms, and laundry services for 76 unhoused neighbors. Volunteer Mike Mailand is careful with his words: \"We don't call them clients. We call them our neighbors.\"",
      "extended_summary": "On a bitterly cold evening in Appleton, Wisconsin, hotel lobby tables filled with simple, warm food: chicken sandwiches, coleslaw, pudding cups, noodle soup. It wasn't fancy. It wasn't meant to be. It was offered without condition to 76 people—men, women, and families—who had been living in cars, camping in the woods, or sleeping on the streets. When temperatures drop below 10 degrees or wind chills become life-threatening, Appleton activates a cold-weather response that includes hotel rooms, food, laundry, transportation, and pastoral presence. St. Thomas More Parish, along with other local churches, coordinates the effort. Volunteer Mike Mailand is intentional about language: \"We don't say clients. We don't say the homeless. We call them our neighbors.\" In a season of brutal cold, that distinction—and the hospitality behind it—feels almost sacramental.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Human Story"
      ],
      "source_url": "https://onmissionmedia.com/abundant-hospitality-in-a-season-of-cold/?utm_source=rss&utm_medium=rss&utm_campaign=abundant-hospitality-in-a-season-of-cold",
      "source_name": "thecompassnews.org",
      "published_ts": 1771852892683,
      "image_url": "https://onmissionmedia.com/wp-content/uploads/2026/02/MJC_9797-scaled.jpeg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_044_newborn_puppies_saved_after_being_left_in_box",
      "title": "Newborn puppies saved after being left in box",
      "summary": "Nine newborn puppies were saved by the San Marcos Regional Animal Shelter after being abandoned in a box. Thanks to the quick actions of a good Samaritan and the shelter's dedicated staff, these vulnerable pups received the care they needed. The community's support and collaboration with rescue partners ensured that the puppies were placed in loving foster homes, showcasing the power of compassion in action.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.sanmarcosrecord.com/article/32531,newborn-puppies-saved-after-being-left-in-box",
      "source_name": "sanmarcosrecord.com",
      "published_ts": 1769371206000,
      "image_url": "https://static2.sanmarcosrecord.com/data/articles/xga-4x3-newborn-puppies-saved-after-being-left-in-box-1769183124.jpg"
    },
    {
      "id": "story_003_neighborhood_dog_leads_police_to_missing_3yearold_lassie_fou",
      "title": "Neighborhood dog leads police to missing 3-year-old: 'Lassie found him'",
      "summary": "When a 3-year-old went missing in Louisville, neighbors joined police in the search — but it was a local dog who ultimately found the child and led officers straight to him. One sergeant said it best: 'Lassie found him.'",
      "extended_summary": "A 3-year-old vanished in Louisville, and the whole neighborhood turned out to help police search. Officers combed yards and alleys, calling the child's name, when a neighborhood dog started barking and pulling them in a specific direction. The dog wouldn't stop — it kept circling back, insistent, until officers followed. Moments later, they found the missing toddler safe. One sergeant summed it up: 'Lassie found him.' The dog became an instant local hero, and the relieved family got their child back thanks to four legs and a very good nose.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community",
        "Surprise"
      ],
      "source_url": "https://www.wfla.com/news/national/neighborhood-dog-leads-police-to-missing-3-year-old-lassie-found-him/",
      "source_name": "wfla.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/2003/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 5
    },
    {
      "id": "story_005_a_coin_flip_that_led_to_helping_change_lives_uh_project_help",
      "title": "A coin flip that led to helping change lives- UH project help young children with mobility disabilities",
      "summary": "Ph.D. student Jesus Rodriguez joined the University of Houston specifically to work on P-LEGS, a robotic exoskeleton that helps young children with mobility disabilities learn to walk. His career path came down to a coin flip between computer science and engineering—but his commitment to helping people was never in question.",
      "extended_summary": "Jesus Rodriguez had studied neuroscience but realized lab work wasn't his calling. Torn between computer science and engineering, he literally flipped a coin. Engineering won—and then he discovered the P-LEGS project at the University of Houston. P-LEGS is a robotic exoskeleton designed to rehabilitate young children with mobility disabilities, giving them the chance to walk when their bodies can't do it alone. Rodriguez applied to UH specifically to work with principal investigator Jose Luis Contreras-Vidal on this project. \"Helping people is something I want to do the rest of my life,\" Rodriguez said. That coin flip might have been random, but his purpose wasn't.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://thedailycougar.com/2026/02/18/a-coin-flip-that-led-to-helping-change-lives-uh-project-help-young-children-with-mobility-disabilities/?utm_source=rss&utm_medium=rss&utm_campaign=a-coin-flip-that-led-to-helping-change-lives-uh-project-help-young-children-with-mobility-disabilities",
      "source_name": "thedailycougar.com",
      "published_ts": 1771852892682,
      "image_url": "https://thedailycougar.com/wp-content/uploads/2026/02/021126_Jesus-Rodriguez_RFernandez-2.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_007_refrog_initiative_turns_tcu_moveout_waste_into_community_don",
      "title": "ReFrog Initiative Turns TCU Move-Out Waste into Community Donations",
      "summary": "TCU's ReFrog Initiative collected over 16,500 items during move-out week, keeping the equivalent of 74 dumpsters of student belongings out of landfills. Volunteers redirected furniture, clothes, and supplies to community members who needed them instead of letting them become waste.",
      "extended_summary": "When 16,500 perfectly good items hit the curb during TCU move-out week, volunteers didn't let them become trash. The ReFrog Initiative swept through dorms collecting everything students left behind — mini-fridges, barely-used textbooks, lamps, clothing — and redirected it all to people who actually needed it. The haul filled what would have been 74 dumpsters, turning end-of-semester chaos into a massive community resource exchange. It's proof that one university's discards are another family's furnishings, and that a little coordination can keep mountains of usable stuff out of landfills.",
      "category": "Community",
      "categories": [
        "Community",
        "Discovery",
        "Other"
      ],
      "source_url": "https://magazine.tcu.edu/spring-2026/refrog-initiative-move-out-donations-waste-diversion/",
      "source_name": "magazine.tcu.edu",
      "published_ts": 1771852892682,
      "image_url": "https://magazine.tcu.edu/wp-content/uploads/2026/02/WebHeader-Spr26-Infographic-2-1-e1771420152830.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_008_it_took_a_village_crews_dig_up_road_to_rescue_manatee_trappe",
      "title": "'It took a village': Crews dig up road to rescue manatee trapped in Florida storm drain",
      "summary": "A juvenile manatee got himself wedged in a storm drain in Melbourne Beach, Florida, and couldn't get out. After an architectural firm employee reported it to wildlife officials, multiple agencies dug up the road, pulled the manatee free, and returned him safely to the water.",
      "extended_summary": "Someone walking past a storm drain in Melbourne Beach heard something big moving inside. They called Florida Fish and Wildlife, and responders discovered a juvenile male manatee trapped underground with no way out. Multiple agencies showed up — wildlife crews, engineers, and construction teams — and started digging up the road. It took coordination, heavy equipment, and a lot of careful maneuvering, but they finally freed the manatee and carried him back to open water. He swam off unharmed. 'It took a village,' one responder said. And in this case, the village brought shovels.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.wfla.com/news/florida/it-took-a-village-crews-in-florida-dig-up-road-to-rescue-manatee-trapped-in-storm-drain/",
      "source_name": "wfla.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/7993/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_011_local_students_join_forces_to_combat_hunger_in_georgia_and_k",
      "title": "Local students join forces to combat hunger in Georgia and Kentucky",
      "summary": "Students from Lanier High School in Georgia are uniting to combat hunger by partnering with Meals to Missions to raise funds for 10,000 nutritious meals. This initiative not only addresses food insecurity locally but also reaches underserved communities in Kentucky, demonstrating the impact of youth-led efforts in making a difference.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://www.northgwinnettvoice.com/local-students-join-forces-to-combat-hunger-in-georgia-and-kentucky/",
      "source_name": "northgwinnettvoice.com",
      "published_ts": 1769141172000,
      "image_url": "https://www.northgwinnettvoice.com/wp-content/uploads/2025/07/Geneva_Melanie-EDITED-65.jpg"
    },
    {
      "id": "story_014_mend_and_munch",
      "title": "Mend and Munch",
      "summary": "The Scotts Run Resonance Project hosts quarterly Repair Cafés where volunteers fix belongings for free while guests enjoy food and live music. Events draw 50-100 people of all ages to learn repair skills, socialize, and restore items from lamps to cast iron pots. One woman discovered her creekbed find was worth $1,500 after bringing it in for restoration.",
      "extended_summary": "A woman walked into a Repair Café carrying a cast iron pot she'd pulled from a creekbed by her childhood home. An internet search revealed it was worth $1,500. That's the kind of discovery that happens when a community gathers to fix things instead of tossing them. The Scotts Run Resonance Project runs these quarterly events where 10-15 skilled volunteers restore whatever people bring—sewing, lamp repair, oddball projects—all free of charge. Between 50 and 100 people show up to learn, eat together, and listen to live music. Director D.J. Cassell, a self-described \"cast iron nerd,\" encourages people to bring anything and see who can fix it. The events have become as much about connection as repair.",
      "category": "Community",
      "categories": [
        "Community",
        "Discovery",
        "Human Story"
      ],
      "source_url": "https://morgantownmag.com/mend-and-munch/?utm_source=rss&utm_medium=rss&utm_campaign=mend-and-munch",
      "source_name": "morgantownmag.com",
      "published_ts": 1771852892683,
      "image_url": "https://morgantownmag.com/wp-content/uploads/Courtesy-of-D.J.-Cassell-2.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 2
    },
    {
      "id": "story_035_utah_man_with_rare_facial_condition_sees_his_life_story_told",
      "title": "Utah man with rare facial condition sees his life story told on the big screen",
      "summary": "Ben Kjar's inspiring journey is now captured on the big screen in the documentary 'STANDOUT: The Ben Kjar Story.' Born with Crouzon Syndrome, Kjar faced bullying and adversity but transformed his challenges into motivation, becoming a champion wrestler and a beacon of hope for others. His story, now reaching audiences nationwide, aims to inspire individuals to overcome their own obstacles and pursue greatness.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Transformation"
      ],
      "source_url": "https://ksltv.com/local-news/utah-man-with-rare-facial-condition/870503/",
      "source_name": "ksltv.com",
      "published_ts": 1769431898000,
      "image_url": "https://cdn.ksltv.com/ksltv/wp-content/uploads/2026/01/Standout_Still3.jpg"
    },
    {
      "id": "story_040_everyone_deserves_a_second_chance",
      "title": "Everyone Deserves a Second Chance",
      "summary": "A 12-year-old caught vaping at school turned his life around through Monongalia County Teen Court, where youth volunteers run peer-based hearings for first-time offenders. Within a year, his grades improved 40% and he's now excited to study music in high school.",
      "extended_summary": "The 12-year-old had a history of defiant behavior, academic struggles, and was around drug users when he was cited for underage tobacco possession. Then he went through Monongalia County Teen Court, where something unusual happened: he stood before a courtroom run entirely by his peers. Teen attorneys, jurors, bailiffs, and clerks—all volunteers trained by local legal professionals—heard his case and determined his sentence. Less than a year later, his report card shows mostly As and Bs, a 40% improvement. He's excited to start high school and study music. Since 2018, Teen Court has offered local youth a chance to take control of their futures, proving that sometimes the best judges are the ones who understand what it's like to make mistakes.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://morgantownmag.com/everyone-deserves-a-second-chance/?utm_source=rss&utm_medium=rss&utm_campaign=everyone-deserves-a-second-chance",
      "source_name": "morgantownmag.com",
      "published_ts": 1771826205389,
      "image_url": "https://morgantownmag.com/wp-content/uploads/MonCountyTeenCourt4-scaled.jpeg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_012_heroic_central_new_york_police_officer_getting_national_atte",
      "title": "Heroic Central New York Police Officer Getting National Attention",
      "summary": "Officer Jamie Pastorello from Syracuse has captured hearts with his compassionate act of helping a woman struggling with groceries in freezing weather. This simple gesture led to a community outpouring of support for Rhea Holmes, who had been living in difficult circumstances. The bond formed between the officer and Rhea not only transformed her life but also highlighted the profound impact of empathy and kindness, proving that even small actions can lead to significant change.",
      "category": "Human Story",
      "categories": [
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://wibx950.com/ixp/39/p/syracuse-officer-cbs-news/",
      "source_name": "wibx950.com",
      "published_ts": 1769100776000,
      "image_url": "https://townsquare.media/site/39/files/2026/01/attachment-618312980_122109271779185947_8209419608064193528_n.jpg?w=1200&q=75&format=natural"
    },
    {
      "id": "story_002_fast_action_and_group_effort_saves_dog_from_icy_plunge",
      "title": "Fast Action and Group Effort Saves Dog from Icy Plunge",
      "summary": "When Ken Rhoads spotted ripples on the iced-over pond, he found a 150-pound Bernese Mountain dog who'd broken through and couldn't climb out. He and his wife tried a scalloping net but needed more hands — neighbors rushed over, and together they pulled Remi to safety and reunited him with his frantic owner next door.",
      "extended_summary": "Ken Rhoads thought he saw a duck. Then he realized a 150-pound dog was thrashing in freezing water, the ice broken beneath him. Remi, the neighbor's Bernese Mountain dog, had bolted onto the pond and fallen through — his owner was already searching the roads, terrified he'd been hit by a car. Rhoads and his wife grabbed a scalloping net and sprinted to the dock, but Remi was too heavy and too cold to pull himself up. Neighbors heard the commotion and ran over. Together, they hauled the exhausted dog onto solid ground and carried him home, soaked and shivering but alive.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://vineyardgazette.com/news/2026/02/11/fast-action-and-group-effort-saves-dog-icy-plunge",
      "source_name": "vineyardgazette.com",
      "published_ts": 1771826205389,
      "image_url": "https://vineyardgazette.com/sites/default/files/article-assets/main-photos/2026/remi_img_1925.jpg",
      "display_mode": "image",
      "display_reason": "medium image but highly visual story",
      "image_confidence": "medium",
      "visual_affinity": 5,
      "headline_pull": 4
    },
    {
      "id": "story_006_dog_rescued_after_43_days_lost_in_the_colorado_rockies",
      "title": "Dog Rescued After 43 Days Lost In The Colorado Rockies",
      "summary": "Rocky, an 11-year-old Lab mix, escaped his harness during a Colorado mountain walk and survived 43 days alone in subzero temps and wolf territory. A nonprofit rescue team finally spotted him — down to half his body weight but still standing — and flew him to California to reunite with his owner.",
      "extended_summary": "Rocky slipped his harness on a Colorado mountain trail and vanished. His owner, mid-move from New Jersey to California, searched until 1 a.m. then had to leave for his new job, heartbroken. For 43 days, the 11-year-old Lab-boxer mix dodged people, cameras, wolves, and subzero nights in the Rockies. He dropped from 50 pounds to 26. Summit Lost Pet Rescue spent weeks tracking sightings until they finally cornered him on February 9 — emaciated, exhausted, but alive. After days of food and medical care, Rocky was flown to California and reunited with his owner. 'He went against all the odds,' the rescuer said.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Surprise"
      ],
      "source_url": "https://cowboystatedaily.com/2026/02/17/new-jersey-dog-rescued-after-43-days-lost-in-the-colorado-rockies/",
      "source_name": "cowboystatedaily.com",
      "published_ts": 1771826205389,
      "image_url": "https://cowboystatedaily.imgix.net/rescued-dog-2-17-26.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_007_blue_spring_state_park_proves_accessibility_belongs_in_natur",
      "title": "Blue Spring State Park proves accessibility belongs in nature",
      "summary": "A recent 'rolling hike' at Blue Spring State Park allowed Mitch Geier, a double amputee, to reconnect with nature alongside his family. Thanks to all-terrain chairs provided by the park, Mitch was able to experience the outdoors in a way he never thought possible after his health challenges. This initiative not only transformed Mitch's experience but also highlighted the importance of accessibility in nature, ensuring everyone can enjoy the beauty of the outdoors regardless of their physical limitations.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community"
      ],
      "source_url": "https://www.beacononlinenews.com/articles/news/blue-spring-state-park-proves-accessibility-belongs-in-nature/",
      "source_name": "beacononlinenews.com",
      "published_ts": 1769118942000,
      "image_url": "https://www.beacononlinenews.com/wp-content/uploads/2026/01/Screenshot-2026-01-22-at-8.49.56 AM-1200x628.png"
    },
    {
      "id": "story_009_poly_prep_students_staff_pack_and_deliver_food_to_community",
      "title": "Poly Prep students, staff pack and deliver food to community members in need",
      "summary": "Poly Prep Country Day School students and staff packed and delivered over 600 bags of food and produce to One Love Community Fridge locations across Brooklyn. More than 70 volunteers participated in the session, part of a three-times-yearly partnership addressing food insecurity. Student leaders Harper Giskan and Ellie Warwick organized the effort as part of their service-learning curriculum focused on Brooklyn's food deserts.",
      "extended_summary": "Harper Giskan is 17 and can watch her work disappear in minutes—in the best way possible. She and classmate Ellie Warwick led over 70 Poly Prep Country Day School volunteers in packing and delivering 600+ bags of produce and pantry items to One Love Community Fridge locations throughout Brooklyn. The school partners with the nonprofit three times per year to address food insecurity and malnutrition. \"It feels pretty surreal that at 17, I can make a real impact in Brooklyn,\" Giskan said, noting that fridges are emptied and enjoyed almost immediately after stocking. Warwick previously launched her own initiative, Nourishing New York, bringing people to the Bowery Mission. Now both students are integrating this work into their service-learning curriculum focused on food deserts.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://brooklynreporter.com/2026/02/poly-prep-students-staff-pack-and-deliver-food-to-community-members-in-need/",
      "source_name": "brooklynreporter.com",
      "published_ts": 1771852892682,
      "image_url": "https://brooklynreporter.com/wp-content/uploads/2026/02/Group-Photo-1024x771.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_010_huntingtons_disease_has_local_man_walkingrunning_causeway_br",
      "title": "Huntington’s Disease Has Local Man Walking/Running Causeway Bridge Daily",
      "summary": "Rip Wagner, diagnosed with Huntington's disease, has turned his daily walks and runs across the Causeway Bridge into a powerful testament to resilience. By maintaining a rigorous exercise routine, he actively combats the progression of his condition while inspiring others with his determination. Rip's journey showcases the importance of movement and positivity in facing life's challenges, reminding us that every step forward is a victory worth celebrating.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://www.thesandpaper.net/articles/bridging-hope-motion-against-huntingtons-disease/",
      "source_name": "thesandpaper.net",
      "published_ts": 1769118616000,
      "image_url": "https://www.thesandpaper.net/wp-content/uploads/2026/01/Causeway-Runner-39.jpg"
    },
    {
      "id": "story_013_isaac_mwebazemukama_transforms_sustainability_and_youth_empo",
      "title": "Isaac Mwebazemukama Transforms Sustainability and Youth Empowerment in Uganda",
      "summary": "Isaac Mwebazemukama founded Leaf Lives Africa, a youth-led initiative in Uganda focused on sustainable agriculture, environmental conservation, and community empowerment. Inspired by his father—a teacher who educated extended family members—Mwebazemukama aims to create a greener, hunger-free Africa for future generations.",
      "extended_summary": "Isaac Mwebazemukama grew up watching his father, a teacher, ensure that not just his own children but extended family members had access to education. That belief—that education is the key to progress—shaped Mwebazemukama's own path as a social innovator in Uganda. He founded Leaf Lives Africa, a youth-led organization addressing immediate community needs through sustainable agriculture and environmental conservation. The initiative isn't just responding to today's hunger—it's building the foundation for a greener, self-sufficient Africa that future generations can sustain.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://africa.com/isaac-mwebazemukama-transforms-sustainability-and-youth-empowerment-in-uganda/",
      "source_name": "africa.com",
      "published_ts": 1771826205389,
      "image_url": "https://africa.com/wp-content/uploads/2026/02/Screenshot-2026-02-18-at-14-38-44-IMG_5145-1-1050x1400.jpg-JPEG-Image-1050-Ã\u0097-1400-pixels.png",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_016_standing_ovation_for_smithtown_father_and_son",
      "title": "Standing Ovation For Smithtown Father And Son",
      "summary": "A Smithtown father-son duo received a standing ovation after rescuing two people who fell through ice during a winter storm. Bradley Fils-Aime heard cries for help, spotted victims in freezing water at Gibbs Pond, and called his FDNY lieutenant father, who helped coordinate the rescue with emergency responders. Both victims were treated for hypothermia and survived.",
      "extended_summary": "Bradley Fils-Aime was home during a January storm when he heard screaming outside. He jumped his fence and saw a father and 12-year-old son struggling in icy water at Gibbs Pond—the boy had fallen in trying to save his dad. Bradley immediately got his father John, an FDNY lieutenant, who rushed to the scene while Bradley's mother called 911. Working with park rangers and firefighters, they coached the victims to crawl across the ice until rescuers could pull them out. Both were hospitalized for hypothermia but survived. The Smithtown school board honored the pair with official commendations and a standing ovation.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community",
        "Human Story"
      ],
      "source_url": "https://longislandmediagroup.com/standing-ovation-for-smithtown-father-and-son/",
      "source_name": "theneighbornewspapers.com",
      "published_ts": 1771852892683,
      "image_url": "https://longislandmediagroup.com/wp-content/uploads/2026/02/Smithtown-BOE-honors-fatherson.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_017_shes_building_a_support_network_for_nashvilles_live_music_co",
      "title": "She’s Building a Support Network for Nashville’s Live Music Community",
      "summary": "Kara Kemp manages ECCHO Live, a Nashville organization providing mental health support and practical resources to the live music industry's behind-the-scenes workers. After years touring with catering crews, she now helps fill gaps for gig workers through free counseling at festivals, retirement planning guidance, and healthcare navigation. The work supports an industry built on temporary employment where essential workers often go unseen.",
      "extended_summary": "Most people see concerts. Kara Kemp sees the hundreds of crew members who make them possible—and the toll that unstable gig work takes. As General Manager of ECCHO Live, she's built a support system for Nashville's live music workers: free therapy sessions at major festivals, retirement savings guidance, healthcare navigation, all filling gaps in an industry with no safety net. She got there through her own years on the road with touring catering crews, work that felt natural growing up as the youngest of nine on a farm. Now she's creating the infrastructure that didn't exist when she started—turning invisible essential work into something the industry actually cares for.",
      "category": "Community",
      "categories": [
        "Community",
        "Human Story",
        "Generosity"
      ],
      "source_url": "https://styleblueprint.com/everyday/kara-kemp-eccho-live/",
      "source_name": "styleblueprint.com",
      "published_ts": 1771852892683,
      "image_url": "https://styleblueprint.com/wp-content/uploads/2026/02/SBNash-FACE-KaraKemp-Enis-Demirci-feature.jpg",
      "display_mode": "text",
      "display_reason": "headline needs summary support",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 2
    },
    {
      "id": "story_017_why_simply_saying_hello_makes_the_world_better",
      "title": "Why simply saying ‘hello’ makes the world better",
      "summary": "In a world increasingly dominated by technology, the simple act of greeting someone can foster connection and improve community spirit. A call to revive casual conversations and friendly hellos emphasizes the importance of social interactions in combating loneliness and building a sense of belonging.",
      "category": "Community",
      "categories": [
        "Community",
        "Human Story"
      ],
      "source_url": "https://baylorlariat.com/2026/01/22/why-simply-saying-hello-makes-the-world-better/",
      "source_name": "baylorlariat.com",
      "published_ts": 1769170198000,
      "image_url": "https://baylorlariat.com/wp-content/uploads/2026/01/Brady-Harris-39-scaled.jpg"
    },
    {
      "id": "story_019_work_recovery_and_second_chances_on_a_wisconsin_manufacturin",
      "title": "Work, recovery and second chances on a Wisconsin manufacturing floor",
      "summary": "Mellisa Edwards hadn't worked in a decade while battling addiction. Last March, she got a job at Apricity Contract Packaging—a Wisconsin manufacturer run entirely by people in recovery. After a rough start, her coworkers helped her turn things around. Now she shows up on time, earns perfect reviews, and is building a stable future.",
      "extended_summary": "Mellisa Edwards didn't want to get out of bed. She'd missed shifts, gotten written up, and was struggling at her new job at Apricity Contract Packaging in Appleton. But her coworkers understood—they were all in recovery too. Apricity is run entirely by people rebuilding their lives after addiction, employing roughly 100 people a year across Wisconsin in a judgment-free environment. Edwards, who hadn't worked in a decade, turned things around with their support. Now she's always on time, earned a perfect performance review, and plans to stay another year while finishing residential treatment. She's not just packaging products—she's building sobriety and a stable employment record, one shift at a time.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community",
        "Human Story"
      ],
      "source_url": "https://wisconsinwatch.org/2026/02/wisconsin-work-recovery-apricity-contract-packaging-manufacturing-appleton/",
      "source_name": "wisconsinwatch.org",
      "published_ts": 1771852892683,
      "image_url": "https://i0.wp.com/wisconsinwatch.org/wp-content/uploads/2026/02/asse313__Apricity_Appleton_Jan_26-scaled.jpg?fit=1200%2C801&quality=100&ssl=1",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_021_child_and_adult_rescued_water_at_belmont_harbor",
      "title": "Child and adult rescued water at Belmont Harbor",
      "summary": "A child and adult fell into Lake Michigan at Chicago's Belmont Harbor. A bystander jumped in and helped both to safety. All three were taken to the hospital.",
      "extended_summary": "At Belmont Harbor, a child and an adult went into Lake Michigan—accidentally, suddenly, and in real danger. A bystander didn't think twice. They jumped in, got to both victims, and kept them afloat until help arrived. All three were pulled out and taken to the hospital. It's the kind of split-second decision most of us hope we'd make but never want to face: cold water, two people struggling, and no time to hesitate. This stranger did it anyway.",
      "category": "Rescue",
      "categories": [
        "Rescue"
      ],
      "source_url": "https://wgntv.com/news/chicago-news/child-and-adult-rescued-water-at-belmont-harbor/",
      "source_name": "cltv.com",
      "published_ts": 1771826205389,
      "image_url": "https://picsum.photos/seed/259/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_025_cranford_man_displays_good_humor_selling_ice_cream_from_a_tr",
      "title": "Cranford man displays ‘good humor’ selling ice cream from a truck made of snow",
      "summary": "A New Jersey man spent 30 hours sculpting a 1953 ice cream truck out of five tons of snow, complete with headlights and a license plate. He's selling Good Humor bars from it for $5 each, raising over $5,000 for a children's hospital where his 104-year-old father once volunteered.",
      "extended_summary": "Robert Schott parked a full-size ice cream truck on his front lawn in Cranford—except it's made entirely of snow. Five tons of it. Thirty hours of carving produced headlights, rims, a front seat, even a license plate reading \"OHSOGOOD.\" He's selling Good Humor bars from the frozen sculpture for five bucks apiece, and people are handing him twenties, fifties, hundreds. The money—over $5,000 so far—goes to Children's Specialized Hospital, where Schott's friend received care and where his 104-year-old father spent years playing checkers with patients and letting them win. It's whimsy with a purpose, and the line wraps around the corner.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Humor"
      ],
      "source_url": "https://njtoday.news/2026/02/17/cranford-man-displays-good-humor-selling-ice-cream-from-a-truck-made-of-snow/",
      "source_name": "njtoday.net",
      "published_ts": 1771826205389,
      "image_url": "https://njtoday.news/wp-content/uploads/2026/02/Robert-Schotts-retrofitted-snow-and-ice-1953-Chevy-truck.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 5,
      "headline_pull": 5
    },
    {
      "id": "story_025_lorain_high_school_teacher_gives_the_ultimate_valentines_day",
      "title": "Lorain High School teacher gives the ultimate Valentine’s Day gift to a complete stranger",
      "summary": "Lorain High School teacher Marissa Garcia joined the bone marrow registry in 2015 after learning how few Hispanic donors existed. Nearly a decade later, she got the call: she was a match for a leukemia patient in Italy. Her donation gave a complete stranger—and her own family shaped by cancer—a shot at life.",
      "extended_summary": "The phone rang just after New Year's. Nearly ten years after Marissa Garcia signed up for the bone marrow registry at a church event, she was told she was a match—for a leukemia patient in Italy. Garcia, a Lorain High School teacher who'd lost her grandfather to leukemia and her grandmother to pancreatic cancer, had joined because Hispanic donors are critically underrepresented, making it harder for patients to find matches. What followed was a rapid, medically demanding process. But for Garcia, it was personal: a chance to honor her family's losses and give a stranger across the ocean a second chance at life.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Human Story",
        "Transformation"
      ],
      "source_url": "https://www.cleveland.com/lorain-county/2026/02/lorain-high-school-teacher-gives-the-ultimate-valentines-day-gift-to-a-complete-stranger.html",
      "source_name": "cleveland.com",
      "published_ts": 1771852892683,
      "image_url": "https://picsum.photos/seed/24/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 3,
      "headline_pull": 4
    },
    {
      "id": "story_026_pet_sanctuary_takes_in_overflow_from_homeless_shelter_amid_u",
      "title": "Pet Sanctuary Takes in Overflow from Homeless Shelter Amid Unprecedented Cold Snap",
      "summary": "When warming shelters in Green Bay hit capacity during a -19°F cold snap, Safe Haven Pet Sanctuary—normally a cat shelter for disabled felines—opened its doors to anyone needing refuge from life-threatening temperatures. A local pastor and her husband are staying overnight to supervise, proving that compassion extends beyond species.",
      "extended_summary": "The thermometer read -19°F overnight, cold enough that a gust of wind could kill an unsheltered person in minutes. Green Bay's warming shelters were turning people away. So Safe Haven Pet Sanctuary, which typically cares for blind and disabled cats, threw open its doors to humans too. \"A cat will warm your heart and your lap, too. Come on in and warm up. All are welcome,\" said board president Joe Becker. A local pastor and her husband volunteered to stay overnight supervising arrivals, turning a small nonprofit into an emergency lifeline when the system failed.",
      "category": "Community",
      "categories": [
        "Community",
        "Rescue",
        "Generosity"
      ],
      "source_url": "https://www.goodnewsnetwork.org/pet-sanctuary-takes-in-overflow-from-homeless-shelter-amid-unprecedented-cold-snap/",
      "source_name": "goodnewsnetwork.org",
      "published_ts": 1771852892683,
      "image_url": "https://www.goodnewsnetwork.org/wp-content/uploads/2026/02/Courtesy-of-Safe-Haven-pet-sanctuary-in-Green-Bay-Wisconsin.jpg",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_027_foster_kids_were_exiting_hospital_in_gowns_following_crisis",
      "title": "Foster kids were exiting hospital in gowns following crisis. A Cleveland nonprofit stepped up to clothe them",
      "summary": "Foster kids were arriving at MetroHealth's clinic in hospital gowns—their clothes too bug-infested or damaged to keep after medical exams. Kathy DiVincenzo's nonprofit Honey From the Rock, Cleveland's first foster care closet, now ensures no child leaves without proper clothing, turning a heartbreaking gap in the system into a dignity-restoring solution.",
      "extended_summary": "A sibling group showed up at their new foster home wearing only hospital gowns and grippy socks. Their clothes had been so filthy and bug-infested that the hospital had no choice but to toss them. It's a scene that plays out regularly at MetroHealth's Foster Care Clinic, where every child entering Cuyahoga County's custody passes through for exams—and sometimes loses the only belongings they had. That's why Kathy DiVincenzo started Honey From the Rock, Cleveland's first foster care closet, providing free clothing, toys, and essentials so kids in crisis don't face their next chapter nearly naked.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity",
        "Transformation"
      ],
      "source_url": "https://www.cleveland.com/news/2026/02/foster-kids-were-exiting-hospital-in-gowns-following-crisis-a-cleveland-nonprofit-stepped-up-to-clothe-them.html",
      "source_name": "cleveland.com",
      "published_ts": 1771852892683,
      "image_url": "https://picsum.photos/seed/23/800/600",
      "display_mode": "text",
      "display_reason": "no usable image",
      "image_confidence": "none",
      "visual_affinity": 3,
      "headline_pull": 3
    },
    {
      "id": "story_029_fall_river_standout_multisport_athlete_has_begun_the_fight_o",
      "title": "Fall River standout multi-sport athlete has begun the fight of his young life with community support",
      "summary": "Wesley Araujo, a talented young athlete from Fall River, is facing a challenging battle against leukemia. The community has rallied around him, creating the #WesStrong movement to raise funds for his medical expenses. This outpouring of support not only highlights the strength of community but also the resilience of a young athlete determined to overcome adversity.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community"
      ],
      "source_url": "https://fallriverreporter.com/fall-river-standout-multi-sport-athlete-has-begun-the-fight-of-his-young-life-with-community-support/?utm_source=rss&utm_medium=rss&utm_campaign=fall-river-standout-multi-sport-athlete-has-begun-the-fight-of-his-young-life-with-community-support",
      "source_name": "fallriverreporter.com",
      "published_ts": 1769408827000,
      "image_url": "https://fallriverreporter.com/wp-content/uploads/2026/01/Wesley-Araujo.jpg"
    },
    {
      "id": "story_032_neighbors_helping_neighbors_friendship_circle_volunteers_bri",
      "title": "Neighbors helping neighbors: Friendship Circle volunteers bring warmth in the cold",
      "summary": "When temperatures plummeted, the Friendship Circle Café and Bakery sprang into action, organizing volunteers to prepare and deliver hot soup to those in need. Rabbi Levi Stein and his team worked tirelessly to ensure that isolated individuals received nourishment and warmth during the harsh winter. This initiative highlights the power of community support and the importance of looking out for one another, especially in challenging times.",
      "category": "Community",
      "categories": [
        "Community",
        "Generosity"
      ],
      "source_url": "https://www.tmj4.com/news/milwaukee-tonight/neighbors-helping-neighbors-friendship-circle-volunteers-bring-warmth-in-the-cold",
      "source_name": "tmj4.com",
      "published_ts": 1769256715000,
      "image_url": "https://ewscripps.brightspotcdn.com/dims4/default/a4b4d5c/2147483647/strip/true/crop/1440x756+0+313/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F69%2F38%2F234cc5ba408cbe0211e7ee3dc346%2Ffriendship-cookies.jpg"
    },
    {
      "id": "story_034_mother_of_3_reunites_with_good_samaritan_after_crashing_into",
      "title": "Mother of 3 reunites with good Samaritan after crashing into canal",
      "summary": "Shyeniqua Wilkins reunited with Casey Curtis, the stranger who pulled her and her three kids from a sinking car after she had a seizure while driving. Her 8-year-old reached the surface and screamed for help, and Curtis turned his car around just in time to save them all.",
      "extended_summary": "Shyeniqua Wilkins doesn't remember crashing into the canal. She was driving when a seizure hit, sending her car plunging into the water with her three kids inside. Her 8-year-old somehow made it to the surface and screamed. Casey Curtis saw the crash in his rearview mirror and didn't hesitate—he turned around, dove in, and pulled all four of them out before the water swallowed the car. Days later, recovering in a hospital bed with her baby girl safe beside her, Wilkins met Curtis face-to-face. \"You're a part of the family now,\" she told him. If he hadn't turned around, she said, none of them would be breathing.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Human Story",
        "Community"
      ],
      "source_url": "https://wsvn.com/news/local/florida/mother-of-3-reunites-with-good-samaritan-after-crashing-into-canal/",
      "source_name": "wsvn.com",
      "published_ts": 1771826205389,
      "image_url": "https://wsvn.com/wp-content/uploads/sites/2/2026/02/021726-Mother-of-3-reunites-with-good-Samaritan-after-crashing-into-canal.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 4
    },
    {
      "id": "story_043_fdny_paramedics_help_deliver_baby_at_whitehall_ferry_termina",
      "title": "FDNY paramedics help deliver baby at Whitehall Ferry Terminal",
      "summary": "Two FDNY paramedics made headlines after assisting with the delivery of a baby at the Whitehall Ferry Terminal. Their quick thinking and expertise ensured the safety of both mother and child during an unexpected situation. This incident highlights the dedication and readiness of emergency responders to handle any challenge, reinforcing the importance of community safety and support.",
      "category": "Rescue",
      "categories": [
        "Rescue",
        "Community"
      ],
      "source_url": "https://www.silive.com/news/2026/01/fdny-paramedics-help-deliver-baby-at-whitehall-ferry-terminal.html",
      "source_name": "silive.com",
      "published_ts": 1769416462000,
      "image_url": "https://www.silive.com/resizer/v2/YTMLUC3MNFF2NIFI66VRCIP46I.jpg?auth=8db03a05acef89640e341ee239aed4984016bc18e8c97415b1f7583d4a1ecfea&width=1280&smart=true&quality=90"
    },
    {
      "id": "story_046_oral_surgeon_fixes_smiles_transforms_lives_in_bangladesh",
      "title": "Oral Surgeon Fixes Smiles, Transforms Lives in Bangladesh",
      "summary": "Dr. John Wallace and his team at Smile Bangladesh are changing lives one smile at a time by providing crucial surgeries for children with cleft lips and palates. Operating in a country with limited access to such medical care, Wallace's nonprofit has been transforming lives for over two decades, offering hope and a chance for a better future. Each surgery, costing around $300, not only restores physical appearance but also opens doors to improved nutrition, communication, and social integration.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Community"
      ],
      "source_url": "https://www.peoplenewspapers.com/2026/01/20/oral-surgeon-fixes-smiles-transforms-lives-in-bangladesh/",
      "source_name": "parkcitiespeople.com",
      "published_ts": 1769048770000,
      "image_url": "https://www.peoplenewspapers.com/wp-content/uploads/2026/01/IMG_8850_WEB.jpg"
    },
    {
      "id": "story_048_pitt_meadows_school_creates_kindness_cards_for_people_in_nee",
      "title": "Pitt Meadows school creates kindness cards for people in need",
      "summary": "Students at Edith McDermott Elementary created 78 kindness cards for clients at the Salvation Army as part of a Pink Shirt Day competition. The initiative has spread to two more schools, with students discovering they can make an impact beyond classroom walls.",
      "extended_summary": "Under teacher Kaitlyn Brett's guidance, students at Edith McDermott Elementary made 78 handmade kindness cards—each with its own positive message—and delivered them to people in need at the Salvation Army Ridge Meadows Ministry on Friday, Feb. 13. The cards, decorated with hearts and paper shirts, were part of a Kindness Card Competition leading up to Pink Shirt Day. Brett wanted her students to learn they could create impact outside the school walls. The project caught on: two other schools, Davie Jones Elementary and Blue Mountain Elementary, have now joined the challenge to create even more cards for people who need a reminder that someone cares.",
      "category": "Generosity",
      "categories": [
        "Generosity",
        "Community"
      ],
      "source_url": "https://mapleridgenews.com/2026/02/17/pitt-meadows-school-creates-kindness-cards-for-people-in-need/",
      "source_name": "mapleridgenews.com",
      "published_ts": 1771826205389,
      "image_url": "https://mapleridgenews.com/wp-content/uploads/sites/5/2026/02/41605725_web1_260217-MRN-CF-cards-SalvationArmy-PinkShirt-EdithMcDermott_2.jpg?w=1024",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 3
    },
    {
      "id": "story_049_young_cancer_survivor_from_alexandria_celebrated_new_years_w",
      "title": "Young cancer survivor from Alexandria celebrated New Year’s with surprise Caps tickets",
      "summary": "Sutton Bullard, a 7-year-old cancer survivor, celebrated the New Year with surprise tickets to see her favorite hockey team, the Washington Capitals. After completing her chemotherapy, Sutton's dream came true when she not only attended the game but also reunited with goaltender Logan Thompson, who had supported her during her treatment. This heartwarming moment marks a new chapter in Sutton's life, filled with hope and joy.",
      "category": "Transformation",
      "categories": [
        "Transformation",
        "Human Story"
      ],
      "source_url": "https://www.alxnow.com/2026/01/22/young-cancer-survivor-from-alexandria-celebrated-new-years-with-surprise-caps-tickets/",
      "source_name": "alxnow.com",
      "published_ts": 1769139911000,
      "image_url": "https://www.alxnow.com/files/2026/01/IMG_3288-e1768324300135.jpeg"
    },
    {
      "id": "story_008_worlds_oldest_known_rock_art_predates_modern_humans_entrance",
      "title": "World's oldest known rock art predates modern humans' entrance into Europe — and it was found in an Indonesian cave",
      "summary": "Scientists have uncovered the world's oldest known rock art, a hand stencil dating back at least 67,800 years, in a cave in Indonesia. This groundbreaking discovery not only provides insight into the early presence of modern humans in the region but also enriches our understanding of human creativity and expression long before recorded history. As researchers continue to explore these ancient sites, we gain a deeper appreciation for the artistic capabilities of our ancestors.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Science"
      ],
      "source_url": "https://www.livescience.com/archaeology/worlds-oldest-known-rock-art-predates-modern-humans-entrance-into-europe-and-it-was-found-in-an-indonesian-cave",
      "source_name": "livescience.com",
      "published_ts": 1769040000000,
      "image_url": "https://cdn.mos.cms.futurecdn.net/ZPQTpczJ4AcrdVVASRJZVb-2560-80.jpg"
    },
    {
      "id": "story_026_local_brewery_will_discount_its_beer_based_on_how_much_snow",
      "title": "Local brewery will discount its beer based on how much snow falls. They're predicting drafts will sell for 25 cents",
      "summary": "A Philadelphia brewery is dropping its beer price by $1 for every inch of snow that falls this weekend. With 12-18 inches expected, their $8 brew could sell for just 25 cents—the lowest they can go while still covering costs.",
      "extended_summary": "Human Robot brewery in Philly is turning a snowstorm into a party: for every inch that falls, they're knocking a dollar off their TMAVY 13° beer. With up to 18 inches forecast, that $8 pint could drop to a quarter—literally the rock-bottom price co-owner Jake Atkinson says they can manage. It's a playful way to give snow-weary locals something to smile about, proof that a little creativity can turn a blizzard into a reason to gather.",
      "category": "Community",
      "categories": [
        "Community",
        "Humor"
      ],
      "source_url": "https://www.phillyvoice.com/human-robot-beer-snow-discount/?utm_source=pv-rss&utm_medium=rss&utm_campaign=pv-site",
      "source_name": "phillyvoice.com",
      "published_ts": 1771826205389,
      "image_url": "https://media.phillyvoice.com/media/images/Human_robot_snow_deal.2e16d0ba.fill-1200x630-c0.png",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 3,
      "headline_pull": 5
    },
    {
      "id": "story_004_colorado_police_deliver_food_after_arrest",
      "title": "Colorado Police Deliver Food After Arrest",
      "summary": "A Colorado DoorDash driver got pulled over for expired tags and arrested on an outstanding warrant — mid-delivery. Wheat Ridge police couldn't let the food go to waste, so an officer finished the delivery himself, showing up at the customer's door with their meal and bodycam footage to prove it.",
      "extended_summary": "You order dinner on DoorDash, then wait. And wait. Then a police officer shows up at your door holding your food. That's exactly what happened to one Colorado customer after their delivery driver was pulled over for expired tags and arrested on a warrant. The driver had been cooperative and mid-route, so Wheat Ridge officers did what seemed obvious: one of them grabbed the bag and finished the delivery. 'We wanted to make sure you got the food still,' the officer told the very surprised customer. The department posted bodycam footage of the moment, and the internet loved it.",
      "category": "Humor",
      "categories": [
        "Humor",
        "Community"
      ],
      "source_url": "https://95rockfm.com/ixp/48/p/doordashing-police-delivery/",
      "source_name": "95rockfm.com",
      "published_ts": 1771826205389,
      "image_url": "https://townsquare.media/site/48/files/2026/02/attachment-2-515.jpg?w=1200&format=natural",
      "display_mode": "image",
      "display_reason": "strong image and headline",
      "image_confidence": "high",
      "visual_affinity": 4,
      "headline_pull": 5
    },
    {
      "id": "story_048_tiny_falcons_are_helping_keep_the_food_supply_safe_on_cherry",
      "title": "Tiny falcons are helping keep the food supply safe on cherry farms",
      "summary": "American kestrels, the smallest falcons, are playing a vital role in protecting cherry farms in northern Michigan. By preying on pests that threaten crops, these birds not only help farmers reduce damage but also lower the risk of food-borne illnesses. New research shows that orchards with kestrels experience significantly less crop damage, demonstrating the beneficial relationship between wildlife and agriculture.",
      "category": "Discovery",
      "categories": [
        "Discovery",
        "Science"
      ],
      "source_url": "https://arstechnica.com/science/2026/01/tiny-falcons-are-helping-keep-the-food-supply-safe-on-cherry-farms/",
      "source_name": "arstechnica.com",
      "published_ts": 1769206248000,
      "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/kestrel-1152x648.jpg"
    }
  ]
}